#![no_std]
#![allow(nonstandard_style)]
extern crate c_types;
/* automatically generated by rust-bindgen 0.64.0 */

pub const SL_STATUS_SPACE_MASK: u32 = 65280;
pub const SL_STATUS_GENERIC_SPACE: u32 = 0;
pub const SL_STATUS_PLATFORM_1_SPACE: u32 = 256;
pub const SL_STATUS_PLATFORM_2_SPACE: u32 = 512;
pub const SL_STATUS_HARDWARE_SPACE: u32 = 768;
pub const SL_STATUS_BLUETOOTH_SPACE: u32 = 1024;
pub const SL_STATUS_BLUETOOTH_MESH_SPACE: u32 = 1280;
pub const SL_STATUS_CAN_CANOPEN_SPACE: u32 = 1536;
pub const SL_STATUS_CONNECT_SPACE: u32 = 1792;
pub const SL_STATUS_NET_SUITE_SPACE: u32 = 2048;
pub const UINT32_THREAD_SPACE: u32 = 2304;
pub const SL_STATUS_USB_SPACE: u32 = 2560;
pub const SL_STATUS_WIFI_SPACE: u32 = 2816;
pub const SL_STATUS_ZIGBEE_SPACE: u32 = 3072;
pub const SL_STATUS_Z_WAVE_SPACE: u32 = 3328;
pub const SL_STATUS_GECKO_OS_1_SPACE: u32 = 3584;
pub const SL_STATUS_GECKO_OS_2_SPACE: u32 = 3840;
pub const SL_STATUS_BLUETOOTH_CTRL_SPACE: u32 = 4096;
pub const SL_STATUS_BLUETOOTH_ATT_SPACE: u32 = 4352;
pub const SL_STATUS_BLUETOOTH_SMP_SPACE: u32 = 4608;
pub const SL_STATUS_BLUETOOTH_MESH_FOUNDATION_SPACE: u32 = 4864;
pub const SL_STATUS_OK: u32 = 0;
pub const SL_STATUS_FAIL: u32 = 1;
pub const SL_STATUS_INVALID_STATE: u32 = 2;
pub const SL_STATUS_NOT_READY: u32 = 3;
pub const SL_STATUS_BUSY: u32 = 4;
pub const SL_STATUS_IN_PROGRESS: u32 = 5;
pub const SL_STATUS_ABORT: u32 = 6;
pub const UINT32_TIMEOUT: u32 = 7;
pub const SL_STATUS_PERMISSION: u32 = 8;

pub const __SIZEOF_PTHREAD_BARRIERATTR_T: u32 = 4;
pub const _THREAD_MUTEX_INTERNAL_H: u32 = 1;
pub const __PTHREAD_MUTEX_HAVE_PREV: u32 = 0;
pub const __have_pthread_attr_t: u32 = 1;
pub const _ALLOCA_H: u32 = 1;
pub const _STRING_H: u32 = 1;
pub const _BITS_TYPES_LOCALE_T_H: u32 = 1;
pub const _BITS_TYPES___LOCALE_T_H: u32 = 1;
pub const _STRINGS_H: u32 = 1;
pub const _STDIO_H: u32 = 1;
pub const __GNUC_VA_LIST: u32 = 1;
pub const _____fpos_t_defined: u32 = 1;
pub const ____mbstate_t_defined: u32 = 1;
pub const _____fpos64_t_defined: u32 = 1;
pub const ____FILE_defined: u32 = 1;
pub const __FILE_defined: u32 = 1;
pub const __struct_FILE_defined: u32 = 1;
pub const _IO_EOF_SEEN: u32 = 16;
pub const _IO_ERR_SEEN: u32 = 32;
pub const _IO_USER_LOCK: u32 = 32768;
pub const _IOFBF: u32 = 0;
pub const _IOLBF: u32 = 1;
pub const _IONBF: u32 = 2;
pub const BUFSIZ: u32 = 8192;
pub const EOF: i32 = -1;
pub const SEEK_SET: u32 = 0;
pub const SEEK_CUR: u32 = 1;
pub const SEEK_END: u32 = 2;
pub const P_tmpdir: &[u8; 5usize] = b"/tmp\0";
pub const _BITS_STDIO_LIM_H: u32 = 1;
pub const L_tmpnam: u32 = 20;
pub const TMP_MAX: u32 = 238328;
pub const FILENAME_MAX: u32 = 4096;
pub const L_ctermid: u32 = 9;
pub const FOPEN_MAX: u32 = 16;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub type __u_char = c_types::c_uchar;
pub type __u_short = c_types::c_ushort;
pub type __u_int = c_types::c_uint;
pub type __u_long = c_types::c_ulong;
pub type __int8_t = c_types::c_schar;
pub type __uint8_t = c_types::c_uchar;
pub type __int16_t = c_types::c_short;
pub type __uint16_t = c_types::c_ushort;
pub type __int32_t = c_types::c_int;
pub type __uint32_t = c_types::c_uint;
pub type __int64_t = c_types::c_longlong;
pub type __uint64_t = c_types::c_ulonglong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = c_types::c_longlong;
pub type __u_quad_t = c_types::c_ulonglong;
pub type __intmax_t = c_types::c_longlong;
pub type __uintmax_t = c_types::c_ulonglong;
pub type __dev_t = __uint64_t;
pub type __uid_t = c_types::c_uint;
pub type __gid_t = c_types::c_uint;
pub type __ino_t = c_types::c_ulong;
pub type __ino64_t = __uint64_t;
pub type __mode_t = c_types::c_uint;
pub type __nlink_t = c_types::c_uint;
pub type __off_t = c_types::c_long;
pub type __off64_t = __int64_t;
pub type __pid_t = c_types::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __fsid_t {
    pub __val: [c_types::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = c_types::c_long;
pub type __rlim_t = c_types::c_ulong;
pub type __rlim64_t = __uint64_t;
pub type __id_t = c_types::c_uint;
pub type __time_t = c_types::c_long;
pub type __useconds_t = c_types::c_uint;
pub type __suseconds_t = c_types::c_long;
pub type __daddr_t = c_types::c_int;
pub type __key_t = c_types::c_int;
pub type __clockid_t = c_types::c_int;
pub type __timer_t = *mut c_types::c_void;
pub type __blksize_t = c_types::c_long;
pub type __blkcnt_t = c_types::c_long;
pub type __blkcnt64_t = __int64_t;
pub type __fsblkcnt_t = c_types::c_ulong;
pub type __fsblkcnt64_t = __uint64_t;
pub type __fsfilcnt_t = c_types::c_ulong;
pub type __fsfilcnt64_t = __uint64_t;
pub type __fsword_t = c_types::c_int;
pub type __ssize_t = c_types::c_int;
pub type __syscall_slong_t = c_types::c_long;
pub type __syscall_ulong_t = c_types::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut c_types::c_char;
pub type __intptr_t = c_types::c_int;
pub type __socklen_t = c_types::c_uint;
pub type __sig_atomic_t = c_types::c_int;
pub type __time64_t = __int64_t;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = c_types::c_schar;
pub type int_fast16_t = c_types::c_int;
pub type int_fast32_t = c_types::c_int;
pub type int_fast64_t = c_types::c_longlong;
pub type uint_fast8_t = c_types::c_uchar;
pub type uint_fast16_t = c_types::c_uint;
pub type uint_fast32_t = c_types::c_uint;
pub type uint_fast64_t = c_types::c_ulonglong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = "   DATA TYPES   *******************************"]
pub type sl_status_t = u32;
#[doc = "<Firmware rollback error, no data returned"]
pub const sl_wfx_error_e_SL_WFX_ERROR_FIRMWARE_ROLLBACK: sl_wfx_error_e = 0;
#[doc = "<Not used anymore"]
pub const sl_wfx_error_e_SL_WFX_ERROR_DEPRECATED_0: sl_wfx_error_e = 1;
#[doc = "<Not used anymore"]
pub const sl_wfx_error_e_SL_WFX_ERROR_DEPRECATED_1: sl_wfx_error_e = 2;
#[doc = "<Secure Link Session key is invalid (probably not initialized)"]
pub const sl_wfx_error_e_SL_WFX_ERROR_INVALID_SESSION_KEY: sl_wfx_error_e = 3;
#[doc = "<Out-of-range power supply voltage detected, the last voltage value is returned. Param: measured voltage (mV)"]
pub const sl_wfx_error_e_SL_WFX_ERROR_OOR_VOLTAGE: sl_wfx_error_e = 4;
#[doc = "<Wrong PDS version detected, no data returned"]
pub const sl_wfx_error_e_SL_WFX_ERROR_PDS_VERSION: sl_wfx_error_e = 5;
#[doc = "<Out-of-range temperature, no data returned"]
pub const sl_wfx_error_e_SL_WFX_ERROR_OOR_TEMPERATURE: sl_wfx_error_e = 6;
#[doc = "<Requests from Host are forbidden until the end of key exchange (Host should wait for the associated indication)"]
pub const sl_wfx_error_e_SL_WFX_ERROR_REQ_DURING_KEY_EXCHANGE: sl_wfx_error_e = 7;
#[doc = "<Not used anymore"]
pub const sl_wfx_error_e_SL_WFX_ERROR_DEPRECATED_2: sl_wfx_error_e = 8;
#[doc = "<Not used anymore"]
pub const sl_wfx_error_e_SL_WFX_ERROR_DEPRECATED_3: sl_wfx_error_e = 9;
#[doc = "<An error occured during message decryption (can be a counter mismatch or wrong CCM tag)"]
pub const sl_wfx_error_e_SL_WFX_ERROR_SECURELINK_DECRYPTION: sl_wfx_error_e = 10;
#[doc = "< Encryption state of the received message doesn't match the SecureLink bitmap. Param: was encrypted"]
pub const sl_wfx_error_e_SL_WFX_ERROR_SECURELINK_WRONG_ENCRYPTION_STATE: sl_wfx_error_e = 11;
#[doc = "<SPI or SDIO bus clock is too slow (<1kHz)"]
pub const sl_wfx_error_e_SL_WFX_SPI_OR_SDIO_FREQ_TOO_LOW: sl_wfx_error_e = 12;
#[doc = "<Not used anymore"]
pub const sl_wfx_error_e_SL_WFX_ERROR_DEPRECATED_4: sl_wfx_error_e = 13;
#[doc = "<Not used anymore"]
pub const sl_wfx_error_e_SL_WFX_ERROR_DEPRECATED_5: sl_wfx_error_e = 14;
#[doc = "<HIF HW has reported an error. Param: HIF status register"]
pub const sl_wfx_error_e_SL_WFX_HIF_BUS_ERROR: sl_wfx_error_e = 15;
#[doc = "<Unknown TestFeatureMode during test feature init"]
pub const sl_wfx_error_e_SL_WFX_PDS_TESTFEATURE_MODE_ERROR: sl_wfx_error_e = 16;
#[doc = "<The SecureLink bitmap must be configured right after key exchange"]
pub const sl_wfx_error_e_SL_WFX_ERROR_SECURELINK_EXPECTED_BITMAP: sl_wfx_error_e = 17;
#[doc = " @brief specifies the type of error reported by the indication message sl_wfx_error_ind_body_t\n"]
pub type sl_wfx_error_e = c_types::c_uint;
#[doc = " @brief specifies the type of error reported by the indication message sl_wfx_error_ind_body_t\n"]
pub use self::sl_wfx_error_e as sl_wfx_error_t;
#[doc = "< Data rate 802.11b 1Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_B_1MBPS: sl_wfx_rate_index_e = 0;
#[doc = "< Data rate 802.11b 2Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_B_2MBPS: sl_wfx_rate_index_e = 1;
#[doc = "< Data rate 802.11b 5.5Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_B_5P5MBPS: sl_wfx_rate_index_e = 2;
#[doc = "< Data rate 802.11b 11Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_B_11MBPS: sl_wfx_rate_index_e = 3;
#[doc = "<ERP-PBCC, not supported"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_PBCC_22MBPS: sl_wfx_rate_index_e = 4;
#[doc = "<ERP-PBCC, not supported"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_PBCC_33MBPS: sl_wfx_rate_index_e = 5;
#[doc = "< Data rate 802.11g 6Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_6MBPS: sl_wfx_rate_index_e = 6;
#[doc = "< Data rate 802.11g 9Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_9MBPS: sl_wfx_rate_index_e = 7;
#[doc = "< Data rate 802.11g 12Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_12MBPS: sl_wfx_rate_index_e = 8;
#[doc = "< Data rate 802.11g 18Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_18MBPS: sl_wfx_rate_index_e = 9;
#[doc = "< Data rate 802.11g 24Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_24MBPS: sl_wfx_rate_index_e = 10;
#[doc = "< Data rate 802.11g 36Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_36MBPS: sl_wfx_rate_index_e = 11;
#[doc = "< Data rate 802.11g 48Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_48MBPS: sl_wfx_rate_index_e = 12;
#[doc = "< Data rate 802.11g 54Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_G_54MBPS: sl_wfx_rate_index_e = 13;
#[doc = "< Data rate 802.11n 6.5Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_6P5MBPS: sl_wfx_rate_index_e = 14;
#[doc = "< Data rate 802.11n 13Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_13MBPS: sl_wfx_rate_index_e = 15;
#[doc = "< Data rate 802.11n 19.5Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_19P5MBPS: sl_wfx_rate_index_e = 16;
#[doc = "< Data rate 802.11n 26Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_26MBPS: sl_wfx_rate_index_e = 17;
#[doc = "< Data rate 802.11n 39Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_39MBPS: sl_wfx_rate_index_e = 18;
#[doc = "< Data rate 802.11n 52Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_52MBPS: sl_wfx_rate_index_e = 19;
#[doc = "< Data rate 802.11n 58.5Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_58P5MBPS: sl_wfx_rate_index_e = 20;
#[doc = "< Data rate 802.11n 65Mbps"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_INDEX_N_65MBPS: sl_wfx_rate_index_e = 21;
#[doc = "< Number of defined data rates"]
pub const sl_wfx_rate_index_e_SL_WFX_RATE_NUM_ENTRIES: sl_wfx_rate_index_e = 22;
#[doc = " @brief List of possible transmission rates.\n\n Note that ERP-PBCC is not supported by the hardware. The rate indices for 22 Mbit/s and 33 Mbit/s are only provided for standard compatibility.@n\n Data rates (in the names) are for 20 MHz channel operation. Corresponding data rates for 10 MHz channel operation are half of them.\n\n In this API, some parameters such as 'basic_rate_set' encode a list of rates in a bitstream format.@n\n     for instance SUPPORTED_B_RATES_MASK = 0x0000000F @n\n                  SUPPORTED_G_RATES_MASK = 0x00003FC0 @n\n                  SUPPORTED_N_RATES_MASK = 0x003FC000"]
pub type sl_wfx_rate_index_e = c_types::c_uint;
#[doc = " @brief List of possible transmission rates.\n\n Note that ERP-PBCC is not supported by the hardware. The rate indices for 22 Mbit/s and 33 Mbit/s are only provided for standard compatibility.@n\n Data rates (in the names) are for 20 MHz channel operation. Corresponding data rates for 10 MHz channel operation are half of them.\n\n In this API, some parameters such as 'basic_rate_set' encode a list of rates in a bitstream format.@n\n     for instance SUPPORTED_B_RATES_MASK = 0x0000000F @n\n                  SUPPORTED_G_RATES_MASK = 0x00003FC0 @n\n                  SUPPORTED_N_RATES_MASK = 0x003FC000"]
pub use self::sl_wfx_rate_index_e as sl_wfx_rate_index_t;
#[doc = " @brief General Message header structure\n"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_header_s {
    #[doc = "< Message length in bytes including this uint16_t.\n< Maximum value is 8188 but maximum Request size is FW dependent and reported in the ::sl_wfx_startup_ind_body_t::size_inp_ch_buf."]
    pub length: u16,
    #[doc = "< Contains the message Id indexed by sl_wfx_general_commands_ids_t or sl_wfx_message_ids_t."]
    pub id: u8,
    #[doc = "< TODO comment missing"]
    pub info: u8,
}
#[test]
fn bindgen_test_layout_sl_wfx_header_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_header_s> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_header_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_header_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_header_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_header_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_header_s),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_header_s),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_header_s),
            "::",
            stringify!(info)
        )
    );
}
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_header_t = sl_wfx_header_s;
#[doc = " @brief Generic message structure for all requests, confirmations and indications\n"]
#[repr(C, packed)]
pub struct sl_wfx_generic_message_s {
    #[doc = "<4 bytes header"]
    pub header: sl_wfx_header_t,
    #[doc = "<variable size payload of the message"]
    pub body: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_generic_message_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_generic_message_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_generic_message_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_generic_message_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_generic_message_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_generic_message_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_message_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_message_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Generic message structure for all requests, confirmations and indications\n"]
pub type sl_wfx_generic_message_t = sl_wfx_generic_message_s;
#[doc = " @brief Generic confirmation message with the body reduced to the status field.\n\n This structure is not related to a specific confirmation ID. @n\n It is a global simplified structure that can be used to easily access the header and status fields.\n\n All confirmation bodies start with a status word and in a lot of them it is followed by other data (not present in this structure)."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_generic_confirmation_s {
    #[doc = "<4 bytes header"]
    pub header: sl_wfx_header_t,
    #[doc = "<See enum sl_wfx_status_t"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_generic_confirmation_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_generic_confirmation_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_generic_confirmation_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_generic_confirmation_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_generic_confirmation_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_generic_confirmation_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_confirmation_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_confirmation_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Generic confirmation message with the body reduced to the status field.\n\n This structure is not related to a specific confirmation ID. @n\n It is a global simplified structure that can be used to easily access the header and status fields.\n\n All confirmation bodies start with a status word and in a lot of them it is followed by other data (not present in this structure)."]
pub type sl_wfx_generic_confirmation_t = sl_wfx_generic_confirmation_s;
#[doc = "< \\b CONFIGURATION request Id use body sl_wfx_configuration_req_body_t and returns sl_wfx_configuration_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_CONFIGURATION_REQ_ID: sl_wfx_generic_requests_ids_e =
    9;
#[doc = "< \\b CONTROL_GPIO request Id use body sl_wfx_control_gpio_req_body_t and returns sl_wfx_control_gpio_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_CONTROL_GPIO_REQ_ID: sl_wfx_generic_requests_ids_e =
    38;
#[doc = "< \\b SET_SECURELINK_MAC_KEY request Id use body sl_wfx_set_securelink_mac_key_req_body_t and returns sl_wfx_set_securelink_mac_key_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_SET_SECURELINK_MAC_KEY_REQ_ID:
    sl_wfx_generic_requests_ids_e = 39;
#[doc = "< \\b SECURELINK_EXCHANGE_PUB_KEYS request Id use body sl_wfx_securelink_exchange_pub_keys_req_body_t and returns sl_wfx_securelink_exchange_pub_keys_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_SECURELINK_EXCHANGE_PUB_KEYS_REQ_ID:
    sl_wfx_generic_requests_ids_e = 40;
#[doc = "< \\b SECURELINK_CONFIGURE request Id use body sl_wfx_securelink_configure_req_body_t and returns sl_wfx_securelink_exchange_pub_keys_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_SECURELINK_CONFIGURE_REQ_ID:
    sl_wfx_generic_requests_ids_e = 41;
#[doc = "< \\b PREVENT_ROLLBACK request Id use body sl_wfx_prevent_rollback_req_body_t and returns sl_wfx_prevent_rollback_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_PREVENT_ROLLBACK_REQ_ID:
    sl_wfx_generic_requests_ids_e = 42;
#[doc = "< \\b PTA_SETTINGS request Id use body sl_wfx_pta_settings_req_body_t and returns sl_wfx_pta_settings_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_PTA_SETTINGS_REQ_ID: sl_wfx_generic_requests_ids_e =
    43;
#[doc = "< \\b PTA_PRIORITY request Id use body sl_wfx_pta_priority_req_body_t and returns sl_wfx_pta_priority_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_PTA_PRIORITY_REQ_ID: sl_wfx_generic_requests_ids_e =
    44;
#[doc = "< \\b PTA_STATE request Id use body sl_wfx_pta_state_req_body_t and returns sl_wfx_pta_state_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_PTA_STATE_REQ_ID: sl_wfx_generic_requests_ids_e = 45;
#[doc = "< \\b SET_CCA_CONFIG request Id uses body sl_wfx_set_cca_config_req_body_t and returns sl_wfx_set_cca_config_cnf_body_t"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_SET_CCA_CONFIG_REQ_ID:
    sl_wfx_generic_requests_ids_e = 46;
#[doc = "< \\b SHUT_DOWN request Id use body sl_wfx_shut_down_req_t and never returns"]
pub const sl_wfx_generic_requests_ids_e_SL_WFX_SHUT_DOWN_REQ_ID: sl_wfx_generic_requests_ids_e = 50;
#[doc = " @brief General request message IDs\n\n API general request message IDs available in both split and full MAC.\n These are messages from the host towards the WLAN."]
pub type sl_wfx_generic_requests_ids_e = c_types::c_uint;
#[doc = " @brief General request message IDs\n\n API general request message IDs available in both split and full MAC.\n These are messages from the host towards the WLAN."]
pub use self::sl_wfx_generic_requests_ids_e as sl_wfx_generic_requests_ids_t;
#[doc = "< \\b CONFIGURATION confirmation Id returns body sl_wfx_configuration_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_CONFIGURATION_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 9;
#[doc = "< \\b CONTROL_GPIO confirmation Id returns body sl_wfx_control_gpio_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_CONTROL_GPIO_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 38;
#[doc = "< \\b SET_SECURELINK_MAC_KEY confirmation Id returns body sl_wfx_set_securelink_mac_key_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_SET_SECURELINK_MAC_KEY_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 39;
#[doc = "< \\b SECURELINK_EXCHANGE_PUB_KEYS confirmation Id returns body sl_wfx_securelink_exchange_pub_keys_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_SECURELINK_EXCHANGE_PUB_KEYS_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 40;
#[doc = "< \\b SECURELINK_CONFIGURE confirmation Id returns body sl_wfx_securelink_configure_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_SECURELINK_CONFIGURE_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 41;
#[doc = "< \\b PREVENT_ROLLBACK confirmation Id use body sl_wfx_prevent_rollback_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_PREVENT_ROLLBACK_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 42;
#[doc = "< \\b PTA_SETTINGS confirmation Id returns sl_wfx_pta_settings_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_PTA_SETTINGS_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 43;
#[doc = "< \\b PTA_PRIORITY confirmation Id returns sl_wfx_pta_priority_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_PTA_PRIORITY_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 44;
#[doc = "< \\b PTA_STATE confirmation Id returns sl_wfx_pta_state_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_PTA_STATE_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 45;
#[doc = "< \\b SET_CCA_CONFIG confirmation Id returns body sl_wfx_set_cca_config_cnf_body_t"]
pub const sl_wfx_general_confirmations_ids_e_SL_WFX_SET_CCA_CONFIG_CNF_ID:
    sl_wfx_general_confirmations_ids_e = 46;
#[doc = " @brief General confirmation message IDs\n\n API general confirmation message IDs returned by requests described in sl_wfx_general_requests_ids.\n These are messages from the WLAN towards the host."]
pub type sl_wfx_general_confirmations_ids_e = c_types::c_uint;
#[doc = " @brief General confirmation message IDs\n\n API general confirmation message IDs returned by requests described in sl_wfx_general_requests_ids.\n These are messages from the WLAN towards the host."]
pub use self::sl_wfx_general_confirmations_ids_e as sl_wfx_general_confirmations_ids_t;
#[doc = "< \\b EXCEPTION indication Id content is sl_wfx_exception_ind_body_t"]
pub const sl_wfx_general_indications_ids_e_SL_WFX_EXCEPTION_IND_ID:
    sl_wfx_general_indications_ids_e = 224;
#[doc = "< \\b STARTUP indication Id content is sl_wfx_startup_ind_body_t"]
pub const sl_wfx_general_indications_ids_e_SL_WFX_STARTUP_IND_ID: sl_wfx_general_indications_ids_e =
    225;
#[doc = "< \\b WAKE UP indication Id has no content"]
pub const sl_wfx_general_indications_ids_e_SL_WFX_WAKEUP_IND_ID: sl_wfx_general_indications_ids_e =
    226;
#[doc = "< \\b GENERIC indication Id content is sl_wfx_generic_ind_body_t"]
pub const sl_wfx_general_indications_ids_e_SL_WFX_GENERIC_IND_ID: sl_wfx_general_indications_ids_e =
    227;
#[doc = "< \\b ERROR indication Id content is sl_wfx_error_ind_body_t"]
pub const sl_wfx_general_indications_ids_e_SL_WFX_ERROR_IND_ID: sl_wfx_general_indications_ids_e =
    228;
#[doc = "< \\b SECURELINK_EXCHANGE_PUB_KEYS indication Id content is sl_wfx_securelink_exchange_pub_keys_ind_body_t"]
pub const sl_wfx_general_indications_ids_e_SL_WFX_SECURELINK_EXCHANGE_PUB_KEYS_IND_ID:
    sl_wfx_general_indications_ids_e = 229;
#[doc = " @brief General indications message IDs\n\n API general indication message IDs available in both split and full MAC.\n These are messages from the WLAN towards the host."]
pub type sl_wfx_general_indications_ids_e = c_types::c_uint;
#[doc = " @brief General indications message IDs\n\n API general indication message IDs available in both split and full MAC.\n These are messages from the WLAN towards the host."]
pub use self::sl_wfx_general_indications_ids_e as sl_wfx_general_indications_ids_t;
#[doc = " @brief General command message IDs\n\n All general API message IDs."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union sl_wfx_general_commands_ids_u {
    #[doc = "< Request from the host to the WLAN device"]
    pub request: sl_wfx_generic_requests_ids_t,
    #[doc = "< Confirmation of a request from the WLAN device to the host"]
    pub confirmation: sl_wfx_general_confirmations_ids_t,
    #[doc = "< Indication from the WLAN device to the host"]
    pub indication: sl_wfx_general_indications_ids_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_general_commands_ids_u() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_general_commands_ids_u> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_general_commands_ids_u>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_general_commands_ids_u))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_general_commands_ids_u>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_general_commands_ids_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).request) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_general_commands_ids_u),
            "::",
            stringify!(request)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).confirmation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_general_commands_ids_u),
            "::",
            stringify!(confirmation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).indication) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_general_commands_ids_u),
            "::",
            stringify!(indication)
        )
    );
}
#[doc = " @brief General command message IDs\n\n All general API message IDs."]
pub type sl_wfx_general_commands_ids_t = sl_wfx_general_commands_ids_u;
#[doc = "<The firmware has successfully completed the request."]
pub const sl_wfx_status_e_SL_WFX_STATUS_SUCCESS: sl_wfx_status_e = 0;
#[doc = "<This is a generic failure code : other error codes do not apply."]
pub const sl_wfx_status_e_SL_WFX_STATUS_FAILURE: sl_wfx_status_e = 1;
#[doc = "<The request contains one or more invalid parameters."]
pub const sl_wfx_status_e_SL_WFX_INVALID_PARAMETER: sl_wfx_status_e = 2;
#[doc = "<Warning : the GPIO CMD is successful but the read value is not as expected (likely a drive conflict on the line)"]
pub const sl_wfx_status_e_SL_WFX_STATUS_GPIO_WARNING: sl_wfx_status_e = 3;
#[doc = "<Unknown request ID or wrong interface ID used"]
pub const sl_wfx_status_e_SL_WFX_ERROR_UNSUPPORTED_MSG_ID: sl_wfx_status_e = 4;
#[doc = "<Key has been correctly written"]
pub const sl_wfx_status_e_SL_WFX_MAC_KEY_STATUS_SUCCESS: sl_wfx_status_e = 90;
#[doc = "<Key already exists in OTP"]
pub const sl_wfx_status_e_SL_WFX_MAC_KEY_STATUS_FAILED_KEY_ALREADY_BURNED: sl_wfx_status_e = 107;
#[doc = "<RAM mode is not allowed"]
pub const sl_wfx_status_e_SL_WFX_MAC_KEY_STATUS_FAILED_RAM_MODE_NOT_ALLOWED: sl_wfx_status_e = 124;
#[doc = "<Unknown mode (should be RAM or OTP)"]
pub const sl_wfx_status_e_SL_WFX_MAC_KEY_STATUS_FAILED_UNKNOWN_MODE: sl_wfx_status_e = 141;
#[doc = "<Host Public Key authenticated"]
pub const sl_wfx_status_e_SL_WFX_PUB_KEY_EXCHANGE_STATUS_SUCCESS: sl_wfx_status_e = 158;
#[doc = "<Host Public Key authentication failed"]
pub const sl_wfx_status_e_SL_WFX_PUB_KEY_EXCHANGE_STATUS_FAILED: sl_wfx_status_e = 175;
#[doc = "<OTP rollback value has been successfully updated"]
pub const sl_wfx_status_e_SL_WFX_PREVENT_ROLLBACK_CNF_SUCCESS: sl_wfx_status_e = 4660;
#[doc = "<Wrong magic word detected"]
pub const sl_wfx_status_e_SL_WFX_PREVENT_ROLLBACK_CNF_WRONG_MAGIC_WORD: sl_wfx_status_e = 4694;
#[doc = " @brief General confirmation possible values for returned 'status' field\n WLAN\n All general confirmation messages have a field 'status' just after the message header.@n\n A value of zero indicates the request is completed successfully.\n"]
pub type sl_wfx_status_e = c_types::c_uint;
#[doc = " @brief General confirmation possible values for returned 'status' field\n WLAN\n All general confirmation messages have a field 'status' just after the message header.@n\n A value of zero indicates the request is completed successfully.\n"]
pub use self::sl_wfx_status_e as sl_wfx_status_t;
#[doc = "<Test Firmware"]
pub const sl_wfx_type_e_SL_WFX_FW_TYPE_ETF: sl_wfx_type_e = 0;
#[doc = "<WLAN Full MAC (WFM)"]
pub const sl_wfx_type_e_SL_WFX_FW_TYPE_WFM: sl_wfx_type_e = 1;
#[doc = "<WLAN Split MAC (WSM)"]
pub const sl_wfx_type_e_SL_WFX_FW_TYPE_WSM: sl_wfx_type_e = 2;
#[doc = " @addtogroup General_Configuration\n @brief General configuration commands\n\n\n @{"]
pub type sl_wfx_type_e = c_types::c_uint;
#[doc = " @addtogroup General_Configuration\n @brief General configuration commands\n\n\n @{"]
pub use self::sl_wfx_type_e as sl_wfx_fw_type_t;
#[doc = " @brief Capabilities offered by the WLAN used in command sl_wfx_startup_ind_body_t"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_capabilities_s {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "<Bit 8-15 : Reserved"]
    pub reserved2: u8,
    #[doc = "<Bit 16-23 : Reserved"]
    pub reserved3: u8,
    #[doc = "<Bit 24-31 : Reserved"]
    pub reserved4: u8,
}
#[test]
fn bindgen_test_layout_sl_wfx_capabilities_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_capabilities_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_capabilities_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_capabilities_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_capabilities_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_capabilities_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_capabilities_s),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_capabilities_s),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved4) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_capabilities_s),
            "::",
            stringify!(reserved4)
        )
    );
}
impl sl_wfx_capabilities_s {
    #[inline]
    pub fn linkmode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_linkmode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(linkmode: u8, reserved1: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let linkmode: u8 = unsafe { ::core::mem::transmute(linkmode) };
            linkmode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let reserved1: u8 = unsafe { ::core::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief Capabilities offered by the WLAN used in command sl_wfx_startup_ind_body_t"]
pub type sl_wfx_capabilities_t = sl_wfx_capabilities_s;
#[doc = " @brief REGUL_SEL_MODE OTP field reported in command sl_wfx_startup_ind_body_t"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_otp_regul_sel_mode_info_s {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_sl_wfx_otp_regul_sel_mode_info_s() {
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_otp_regul_sel_mode_info_s>(),
        1usize,
        concat!("Size of: ", stringify!(sl_wfx_otp_regul_sel_mode_info_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_otp_regul_sel_mode_info_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_otp_regul_sel_mode_info_s)
        )
    );
}
impl sl_wfx_otp_regul_sel_mode_info_s {
    #[inline]
    pub fn region_sel_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_region_sel_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        region_sel_mode: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let region_sel_mode: u8 = unsafe { ::core::mem::transmute(region_sel_mode) };
            region_sel_mode as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let reserved: u8 = unsafe { ::core::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief REGUL_SEL_MODE OTP field reported in command sl_wfx_startup_ind_body_t"]
pub type sl_wfx_otp_regul_sel_mode_info_t = sl_wfx_otp_regul_sel_mode_info_s;
#[doc = " @brief OTP_PHY_INFO OTP field reported in command sl_wfx_startup_ind_body_t"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_otp_phy_info_s {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_sl_wfx_otp_phy_info_s() {
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_otp_phy_info_s>(),
        1usize,
        concat!("Size of: ", stringify!(sl_wfx_otp_phy_info_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_otp_phy_info_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_otp_phy_info_s))
    );
}
impl sl_wfx_otp_phy_info_s {
    #[inline]
    pub fn phy1_region(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_phy1_region(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn phy0_region(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_phy0_region(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn otp_phy_ver(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_otp_phy_ver(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        phy1_region: u8,
        phy0_region: u8,
        otp_phy_ver: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let phy1_region: u8 = unsafe { ::core::mem::transmute(phy1_region) };
            phy1_region as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let phy0_region: u8 = unsafe { ::core::mem::transmute(phy0_region) };
            phy0_region as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let otp_phy_ver: u8 = unsafe { ::core::mem::transmute(otp_phy_ver) };
            otp_phy_ver as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief OTP_PHY_INFO OTP field reported in command sl_wfx_startup_ind_body_t"]
pub type sl_wfx_otp_phy_info_t = sl_wfx_otp_phy_info_s;
#[doc = " @brief Startup Indication message.\n This is the first message sent to the host to confirm boot success.\n It gives detailed information on the HW and FW versions and capabilities"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_startup_ind_body_s {
    #[doc = "<Initialization status. A value of zero indicates the boot is completed successfully  (see enum sl_wfx_status_t)"]
    pub status: u32,
    #[doc = "<=RO misc_read_reg7 register value"]
    pub hardware_id: u16,
    #[doc = "<=OTP part_OPN"]
    pub opn: [u8; 14usize],
    #[doc = "<=OTP UID"]
    pub uid: [u8; 8usize],
    #[doc = "<Number of buffers available for request messages."]
    pub num_inp_ch_bufs: u16,
    #[doc = "<TX Buffer size in bytes=request message max size."]
    pub size_inp_ch_buf: u16,
    #[doc = "<number of STA that are supported in AP mode"]
    pub num_links_aP: u8,
    #[doc = "<number of interfaces (WIFI link : STA or AP) that can be created by the user"]
    pub num_interfaces: u8,
    #[doc = "<MAC addresses derived from OTP"]
    pub mac_addr: [[u8; 6usize]; 2usize],
    pub api_version_minor: u8,
    pub api_version_major: u8,
    #[doc = "<List some FW options"]
    pub capabilities: sl_wfx_capabilities_t,
    pub firmware_build: u8,
    pub firmware_minor: u8,
    pub firmware_major: u8,
    #[doc = "<See enum sl_wfx_fw_type_t"]
    pub firmware_type: u8,
    #[doc = "<=OTP Disabled channel list info"]
    pub disabled_channel_list: [u8; 2usize],
    #[doc = "<OTP region selection mode info"]
    pub regul_sel_mode_info: sl_wfx_otp_regul_sel_mode_info_t,
    #[doc = "<info on OTP backoff tables used to enforce the different DFS regulations."]
    pub otp_phy_info: sl_wfx_otp_phy_info_t,
    #[doc = "<A bit mask that indicates which rates are supported by the Physical layer. See enum api_rate_index."]
    pub supported_rate_mask: u32,
    #[doc = "<Null terminated text string describing the loaded FW."]
    pub firmware_label: [u8; 128usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_startup_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_startup_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_startup_ind_body_s>(),
        192usize,
        concat!("Size of: ", stringify!(sl_wfx_startup_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_startup_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_startup_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hardware_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(hardware_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).opn) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(opn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uid) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_inp_ch_bufs) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(num_inp_ch_bufs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size_inp_ch_buf) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(size_inp_ch_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_links_aP) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(num_links_aP)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_interfaces) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(num_interfaces)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).api_version_minor) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(api_version_minor)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).api_version_major) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(api_version_major)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).capabilities) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(capabilities)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_build) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(firmware_build)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_minor) as usize - ptr as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(firmware_minor)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_major) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(firmware_major)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_type) as usize - ptr as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(firmware_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disabled_channel_list) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(disabled_channel_list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).regul_sel_mode_info) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(regul_sel_mode_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).otp_phy_info) as usize - ptr as usize },
        59usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(otp_phy_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).supported_rate_mask) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(supported_rate_mask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).firmware_label) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_body_s),
            "::",
            stringify!(firmware_label)
        )
    );
}
#[doc = " @brief Startup Indication message.\n This is the first message sent to the host to confirm boot success.\n It gives detailed information on the HW and FW versions and capabilities"]
pub type sl_wfx_startup_ind_body_t = sl_wfx_startup_ind_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_startup_ind_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_startup_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_startup_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_startup_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_startup_ind_s>(),
        196usize,
        concat!("Size of: ", stringify!(sl_wfx_startup_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_startup_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_startup_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_startup_ind_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_startup_ind_t = sl_wfx_startup_ind_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_wakeup_ind_t = sl_wfx_header_t;
#[doc = " @brief Configure the device.\n It sends a PDS compressed file that configures the device regarding board dependent parameters.\n The PDS compressed file must fit in a command buffer and have less than 256 elements.\n\n @todo Need to create a specific doc to explain PDS"]
#[repr(C, packed)]
pub struct sl_wfx_configuration_req_body_s {
    #[doc = "<pds_data length in bytes"]
    pub length: u16,
    #[doc = "<variable size PDS data byte array"]
    pub pds_data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_configuration_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_configuration_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_configuration_req_body_s>(),
        2usize,
        concat!("Size of: ", stringify!(sl_wfx_configuration_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_configuration_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_configuration_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_req_body_s),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pds_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_req_body_s),
            "::",
            stringify!(pds_data)
        )
    );
}
#[doc = " @brief Configure the device.\n It sends a PDS compressed file that configures the device regarding board dependent parameters.\n The PDS compressed file must fit in a command buffer and have less than 256 elements.\n\n @todo Need to create a specific doc to explain PDS"]
pub type sl_wfx_configuration_req_body_t = sl_wfx_configuration_req_body_s;
#[repr(C, packed)]
pub struct sl_wfx_configuration_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_configuration_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_configuration_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_configuration_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_configuration_req_s>(),
        6usize,
        concat!("Size of: ", stringify!(sl_wfx_configuration_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_configuration_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_configuration_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_configuration_req_t = sl_wfx_configuration_req_s;
#[doc = " @brief Confirmation message of CONFIGURATION command sl_wfx_configuration_req_body_t"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_configuration_cnf_body_s {
    #[doc = "<Configuration status. A value of zero indicates the boot is completed successfully (see enum sl_wfx_status_t)"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_configuration_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_configuration_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_configuration_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_configuration_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_configuration_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_configuration_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message of CONFIGURATION command sl_wfx_configuration_req_body_t"]
pub type sl_wfx_configuration_cnf_body_t = sl_wfx_configuration_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_configuration_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_configuration_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_configuration_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_configuration_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_configuration_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_configuration_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_configuration_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_configuration_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_configuration_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_configuration_cnf_t = sl_wfx_configuration_cnf_s;
#[doc = "< Configure the GPIO to drive 0"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_D0: sl_wfx_gpio_mode_e = 0;
#[doc = "< Configure the GPIO to drive 1"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_D1: sl_wfx_gpio_mode_e = 1;
#[doc = "< Configure the GPIO to open drain with pull_down to 0"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_OD0: sl_wfx_gpio_mode_e = 2;
#[doc = "< Configure the GPIO to open drain with pull_up to 1"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_OD1: sl_wfx_gpio_mode_e = 3;
#[doc = "< Configure the GPIO to tristate"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_TRISTATE: sl_wfx_gpio_mode_e = 4;
#[doc = "< Toggle the GPIO output value : switches between D0 and D1 or between OD0 and OD1"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_TOGGLE: sl_wfx_gpio_mode_e = 5;
#[doc = "< Read the level at the GPIO pin"]
pub const sl_wfx_gpio_mode_e_SL_WFX_GPIO_MODE_READ: sl_wfx_gpio_mode_e = 6;
#[doc = " @brief Configure GPIO mode. Used in sl_wfx_control_gpio_req_body_t"]
pub type sl_wfx_gpio_mode_e = c_types::c_uint;
#[doc = " @brief Configure GPIO mode. Used in sl_wfx_control_gpio_req_body_t"]
pub use self::sl_wfx_gpio_mode_e as sl_wfx_gpio_mode_t;
#[doc = " @brief Send a request to read or write a GPIO identified by its label (that is defined in the PDS)\n\n After a write it also read back the value to check there is no drive conflict"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_control_gpio_req_body_s {
    #[doc = "<Identify the GPIO by its label (defined in the PDS)"]
    pub gpio_label: u8,
    #[doc = "<define how to set or read the GPIO (see enum sl_wfx_gpio_mode_t)"]
    pub gpio_mode: u8,
}
#[test]
fn bindgen_test_layout_sl_wfx_control_gpio_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_control_gpio_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_control_gpio_req_body_s>(),
        2usize,
        concat!("Size of: ", stringify!(sl_wfx_control_gpio_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_control_gpio_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_control_gpio_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_label) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_req_body_s),
            "::",
            stringify!(gpio_label)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gpio_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_req_body_s),
            "::",
            stringify!(gpio_mode)
        )
    );
}
#[doc = " @brief Send a request to read or write a GPIO identified by its label (that is defined in the PDS)\n\n After a write it also read back the value to check there is no drive conflict"]
pub type sl_wfx_control_gpio_req_body_t = sl_wfx_control_gpio_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_control_gpio_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_control_gpio_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_control_gpio_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_control_gpio_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_control_gpio_req_s>(),
        6usize,
        concat!("Size of: ", stringify!(sl_wfx_control_gpio_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_control_gpio_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_control_gpio_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_control_gpio_req_t = sl_wfx_control_gpio_req_s;
#[doc = "< Undefined GPIO_ID"]
pub const sl_wfx_gpio_error_e_SL_WFX_GPIO_ERROR_0: sl_wfx_gpio_error_e = 0;
#[doc = "< GPIO_ID not configured in GPIO mode (gpio_enabled =0)"]
pub const sl_wfx_gpio_error_e_SL_WFX_GPIO_ERROR_1: sl_wfx_gpio_error_e = 1;
#[doc = "< Toggle not possible while in tristate"]
pub const sl_wfx_gpio_error_e_SL_WFX_GPIO_ERROR_2: sl_wfx_gpio_error_e = 2;
#[doc = " @brief detailed error cause returned by CONTROL_GPIO confirmation message sl_wfx_control_gpio_cnf_body_t"]
pub type sl_wfx_gpio_error_e = c_types::c_uint;
#[doc = " @brief detailed error cause returned by CONTROL_GPIO confirmation message sl_wfx_control_gpio_cnf_body_t"]
pub use self::sl_wfx_gpio_error_e as sl_wfx_gpio_error_t;
#[doc = " @brief Confirmation from request to read and write a GPIO"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_control_gpio_cnf_body_s {
    #[doc = "<enum sl_wfx_status_t : a value of zero indicates the request is completed successfully."]
    pub status: u32,
    #[doc = "<the error detail (see enum sl_wfx_gpio_error_t) when ::sl_wfx_control_gpio_cnf_body_t::status reports an error else the gpio read value."]
    pub value: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_control_gpio_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_control_gpio_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_control_gpio_cnf_body_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_control_gpio_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_control_gpio_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_control_gpio_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_cnf_body_s),
            "::",
            stringify!(value)
        )
    );
}
#[doc = " @brief Confirmation from request to read and write a GPIO"]
pub type sl_wfx_control_gpio_cnf_body_t = sl_wfx_control_gpio_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_control_gpio_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_control_gpio_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_control_gpio_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_control_gpio_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_control_gpio_cnf_s>(),
        12usize,
        concat!("Size of: ", stringify!(sl_wfx_control_gpio_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_control_gpio_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_control_gpio_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_control_gpio_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_control_gpio_cnf_t = sl_wfx_control_gpio_cnf_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_shut_down_req_t = sl_wfx_header_t;
#[doc = "<Byte stream type, currently not used"]
pub const sl_wfx_generic_indication_type_e_SL_WFX_GENERIC_INDICATION_TYPE_RAW:
    sl_wfx_generic_indication_type_e = 0;
#[doc = "<NULL terminating String"]
pub const sl_wfx_generic_indication_type_e_SL_WFX_GENERIC_INDICATION_TYPE_STRING:
    sl_wfx_generic_indication_type_e = 1;
#[doc = "<Rx statistics structure"]
pub const sl_wfx_generic_indication_type_e_SL_WFX_GENERIC_INDICATION_TYPE_RX_STATS:
    sl_wfx_generic_indication_type_e = 2;
#[doc = "<Tx power loop info structure"]
pub const sl_wfx_generic_indication_type_e_SL_WFX_GENERIC_INDICATION_TYPE_TX_PWR_LOOP_INFO:
    sl_wfx_generic_indication_type_e = 3;
#[doc = " @brief specifies the type of data reported by the indication message sl_wfx_generic_ind_body_t\n"]
pub type sl_wfx_generic_indication_type_e = c_types::c_uint;
#[doc = " @brief specifies the type of data reported by the indication message sl_wfx_generic_ind_body_t\n"]
pub use self::sl_wfx_generic_indication_type_e as sl_wfx_generic_indication_type_t;
#[doc = " @brief RX stats from the GENERIC indication message sl_wfx_generic_ind_body_t"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_rx_stats_s {
    #[doc = "<Total number of frame received"]
    pub nb_rx_frame: u32,
    #[doc = "<Number of frame received with bad CRC"]
    pub nb_crc_frame: u32,
    #[doc = "<PER on the total number of frame"]
    pub per_total: u32,
    #[doc = "<Throughput calculated on correct frames received"]
    pub throughput: u32,
    #[doc = "<Number of frame received by rate"]
    pub nb_rx_by_rate: [u32; 22usize],
    #[doc = "<PER*10000 by frame rate"]
    pub per: [u16; 22usize],
    #[doc = "<SNR in Db*100 by frame rate"]
    pub snr: [i16; 22usize],
    #[doc = "<RSSI in Dbm*100 by frame rate"]
    pub rssi: [i16; 22usize],
    #[doc = "<CFO in k_hz by frame rate"]
    pub cfo: [i16; 22usize],
    #[doc = "<This message transmission date in firmware timebase (microsecond)"]
    pub date: u32,
    #[doc = "<Frequency of the low power clock in Hz"]
    pub pwr_clk_freq: u32,
    #[doc = "<Indicate if the low power clock is external"]
    pub is_ext_pwr_clk: u8,
    #[doc = "<Current die temperature in Celsius"]
    pub current_temp: i8,
}
#[test]
fn bindgen_test_layout_sl_wfx_rx_stats_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_rx_stats_s> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_rx_stats_s>(),
        290usize,
        concat!("Size of: ", stringify!(sl_wfx_rx_stats_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_rx_stats_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_rx_stats_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nb_rx_frame) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(nb_rx_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nb_crc_frame) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(nb_crc_frame)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).per_total) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(per_total)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).throughput) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(throughput)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nb_rx_by_rate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(nb_rx_by_rate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).per) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(per)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).snr) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(snr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rssi) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(rssi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cfo) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(cfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).date) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(date)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pwr_clk_freq) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(pwr_clk_freq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_ext_pwr_clk) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(is_ext_pwr_clk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current_temp) as usize - ptr as usize },
        289usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rx_stats_s),
            "::",
            stringify!(current_temp)
        )
    );
}
#[doc = " @brief RX stats from the GENERIC indication message sl_wfx_generic_ind_body_t"]
pub type sl_wfx_rx_stats_t = sl_wfx_rx_stats_s;
#[doc = " @brief TX power loop info from the GENERIC indication message sl_wfx_generic_ind_body_t"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_tx_pwr_loop_info_s {
    #[doc = "<Used Tx digital gain"]
    pub dig_gain: u16,
    #[doc = "<Used Tx PA gain"]
    pub ppa_gain: u16,
    #[doc = "<Power target in qdBm"]
    pub target_pout: i16,
    #[doc = "<FEM output power in qdBm"]
    pub pestimation: i16,
    #[doc = "<Measured Vpdet in mV"]
    pub vpdet: u16,
    #[doc = "<Vpdet measurement index"]
    pub meas_index: u8,
    #[doc = "<Reserved"]
    pub reserved: u8,
}
#[test]
fn bindgen_test_layout_sl_wfx_tx_pwr_loop_info_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_tx_pwr_loop_info_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_tx_pwr_loop_info_s>(),
        12usize,
        concat!("Size of: ", stringify!(sl_wfx_tx_pwr_loop_info_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_tx_pwr_loop_info_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_tx_pwr_loop_info_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dig_gain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(dig_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ppa_gain) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(ppa_gain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).target_pout) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(target_pout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pestimation) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(pestimation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vpdet) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(vpdet)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).meas_index) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(meas_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_tx_pwr_loop_info_s),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " @brief TX power loop info from the GENERIC indication message sl_wfx_generic_ind_body_t"]
pub type sl_wfx_tx_pwr_loop_info_t = sl_wfx_tx_pwr_loop_info_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union sl_wfx_indication_data_u {
    pub rx_stats: sl_wfx_rx_stats_t,
    pub tx_pwr_loop_info: sl_wfx_tx_pwr_loop_info_t,
    pub raw_data: [u8; 376usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_indication_data_u() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_indication_data_u> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_indication_data_u>(),
        376usize,
        concat!("Size of: ", stringify!(sl_wfx_indication_data_u))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_indication_data_u>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_indication_data_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_stats) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_indication_data_u),
            "::",
            stringify!(rx_stats)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_pwr_loop_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_indication_data_u),
            "::",
            stringify!(tx_pwr_loop_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_indication_data_u),
            "::",
            stringify!(raw_data)
        )
    );
}
pub type sl_wfx_indication_data_t = sl_wfx_indication_data_u;
#[doc = " @brief the Generic indication message.\n\n It reports different type of information that can be printed by the driver."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_generic_ind_body_s {
    #[doc = "<Identify the indication data (see enum type sl_wfx_generic_indication_type_t)"]
    pub indication_type: u32,
    #[doc = "<Indication data."]
    pub indication_data: sl_wfx_indication_data_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_generic_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_generic_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_generic_ind_body_s>(),
        380usize,
        concat!("Size of: ", stringify!(sl_wfx_generic_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_generic_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_generic_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).indication_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_ind_body_s),
            "::",
            stringify!(indication_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).indication_data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_ind_body_s),
            "::",
            stringify!(indication_data)
        )
    );
}
#[doc = " @brief the Generic indication message.\n\n It reports different type of information that can be printed by the driver."]
pub type sl_wfx_generic_ind_body_t = sl_wfx_generic_ind_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_generic_ind_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_generic_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_generic_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_generic_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_generic_ind_s>(),
        384usize,
        concat!("Size of: ", stringify!(sl_wfx_generic_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_generic_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_generic_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_generic_ind_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_generic_ind_t = sl_wfx_generic_ind_s;
#[doc = " @brief Exception indication message\n\n It reports unexpected errors. A reboot is needed after this message."]
#[repr(C, packed)]
pub struct sl_wfx_exception_ind_body_s {
    #[doc = "<Reason of the exception"]
    pub reason: u32,
    #[doc = "<Raw data array"]
    pub data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_exception_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_exception_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_exception_ind_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_exception_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_exception_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_exception_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_exception_ind_body_s),
            "::",
            stringify!(reason)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_exception_ind_body_s),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " @brief Exception indication message\n\n It reports unexpected errors. A reboot is needed after this message."]
pub type sl_wfx_exception_ind_body_t = sl_wfx_exception_ind_body_s;
#[repr(C, packed)]
pub struct sl_wfx_exception_ind_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_exception_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_exception_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_exception_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_exception_ind_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_exception_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_exception_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_exception_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_exception_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_exception_ind_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_exception_ind_t = sl_wfx_exception_ind_s;
#[doc = " @brief Error indication message.\n\n It reports user configuration errors.\n A reboot is needed after this message."]
#[repr(C, packed)]
pub struct sl_wfx_error_ind_body_s {
    #[doc = "<error type, see enum sl_wfx_error_t"]
    pub type_: u32,
    #[doc = "<Generic data buffer - contents depends on the error type."]
    pub data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_error_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_error_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_error_ind_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_error_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_error_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_error_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_error_ind_body_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_error_ind_body_s),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " @brief Error indication message.\n\n It reports user configuration errors.\n A reboot is needed after this message."]
pub type sl_wfx_error_ind_body_t = sl_wfx_error_ind_body_s;
#[repr(C, packed)]
pub struct sl_wfx_error_ind_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_error_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_error_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_error_ind_s> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_error_ind_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_error_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_error_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_error_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_error_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_error_ind_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_error_ind_t = sl_wfx_error_ind_s;
#[doc = "<Reserved"]
pub const sl_wfx_secure_link_state_e_SECURE_LINK_NA_MODE: sl_wfx_secure_link_state_e = 0;
#[doc = "<Untrusted mode - SecureLink not available"]
pub const sl_wfx_secure_link_state_e_SECURE_LINK_UNTRUSTED_MODE: sl_wfx_secure_link_state_e = 1;
#[doc = "<Trusted (Evaluation) mode"]
pub const sl_wfx_secure_link_state_e_SECURE_LINK_TRUSTED_MODE: sl_wfx_secure_link_state_e = 2;
#[doc = "<Trusted (Enforced) mode"]
pub const sl_wfx_secure_link_state_e_SECURE_LINK_TRUSTED_ACTIVE_ENFORCED:
    sl_wfx_secure_link_state_e = 3;
#[doc = " @brief *Secure Link' device state"]
pub type sl_wfx_secure_link_state_e = c_types::c_uint;
#[doc = " @brief *Secure Link' device state"]
pub use self::sl_wfx_secure_link_state_e as sl_wfx_secure_link_state_t;
#[doc = "<Key will be stored in OTP"]
pub const sl_wfx_securelink_mac_key_dest_e_SECURE_LINK_MAC_KEY_DEST_OTP:
    sl_wfx_securelink_mac_key_dest_e = 120;
#[doc = "<Key will be stored in RAM"]
pub const sl_wfx_securelink_mac_key_dest_e_SECURE_LINK_MAC_KEY_DEST_RAM:
    sl_wfx_securelink_mac_key_dest_e = 135;
#[doc = " @brief destination of the *Secure Link MAC key*, used by request message sl_wfx_set_securelink_mac_key_req_body_t"]
pub type sl_wfx_securelink_mac_key_dest_e = c_types::c_uint;
#[doc = " @brief destination of the *Secure Link MAC key*, used by request message sl_wfx_set_securelink_mac_key_req_body_t"]
pub use self::sl_wfx_securelink_mac_key_dest_e as sl_wfx_securelink_mac_key_dest_t;
#[doc = " @brief Set the Secure Link MAC key\n\n This API can be used for *Trusted Eval* devices in two contexts:\n - to set a temporary *SecureLink MAC key* in RAM.\n - to permanently burn the *SecureLink MAC key* in OTP memory. In that case, the OTP *SecureLink mode* will\n switch to *Trusted Enforced* mode"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_securemink_mac_key_req_body_s {
    #[doc = "<Key destination - OTP or RAM (see enum sl_wfx_securelink_mac_key_dest_t)"]
    pub otp_or_ram: u8,
    #[doc = "<Secure Link MAC Key value"]
    pub key_value: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_set_securemink_mac_key_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_securemink_mac_key_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_securemink_mac_key_req_body_s>(),
        33usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_set_securemink_mac_key_req_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_securemink_mac_key_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_securemink_mac_key_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).otp_or_ram) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securemink_mac_key_req_body_s),
            "::",
            stringify!(otp_or_ram)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key_value) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securemink_mac_key_req_body_s),
            "::",
            stringify!(key_value)
        )
    );
}
#[doc = " @brief Set the Secure Link MAC key\n\n This API can be used for *Trusted Eval* devices in two contexts:\n - to set a temporary *SecureLink MAC key* in RAM.\n - to permanently burn the *SecureLink MAC key* in OTP memory. In that case, the OTP *SecureLink mode* will\n switch to *Trusted Enforced* mode"]
pub type sl_wfx_set_securelink_mac_key_req_body_t = sl_wfx_set_securemink_mac_key_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_securelink_mac_key_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_set_securelink_mac_key_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_securelink_mac_key_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_securelink_mac_key_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_securelink_mac_key_req_s>(),
        37usize,
        concat!("Size of: ", stringify!(sl_wfx_set_securelink_mac_key_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_securelink_mac_key_req_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_securelink_mac_key_req_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securelink_mac_key_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securelink_mac_key_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_set_securelink_mac_key_req_t = sl_wfx_set_securelink_mac_key_req_s;
#[doc = " @brief Confirmation for the Secure Link MAC key setting"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_securelink_mac_key_cnf_body_s {
    #[doc = "<Key upload status (see enum sl_wfx_status_t)"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_securelink_mac_key_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_securelink_mac_key_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_securelink_mac_key_cnf_body_s>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_set_securelink_mac_key_cnf_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_securelink_mac_key_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_securelink_mac_key_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securelink_mac_key_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation for the Secure Link MAC key setting"]
pub type sl_wfx_set_securelink_mac_key_cnf_body_t = sl_wfx_set_securelink_mac_key_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_securelink_mac_key_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_set_securelink_mac_key_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_securelink_mac_key_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_securelink_mac_key_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_securelink_mac_key_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_securelink_mac_key_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_securelink_mac_key_cnf_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_securelink_mac_key_cnf_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securelink_mac_key_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_securelink_mac_key_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_set_securelink_mac_key_cnf_t = sl_wfx_set_securelink_mac_key_cnf_s;
#[doc = "< Session key is computed using curve25519 algorithm"]
pub const sl_wfx_secure_link_session_key_alg_e_SECURE_LINK_CURVE25519:
    sl_wfx_secure_link_session_key_alg_e = 1;
#[doc = "< Session key is computed using KDF algorithm (not available yet)"]
pub const sl_wfx_secure_link_session_key_alg_e_SECURE_LINK_KDF:
    sl_wfx_secure_link_session_key_alg_e = 2;
#[doc = " @brief Session Key computation algorithms\n"]
pub type sl_wfx_secure_link_session_key_alg_e = c_types::c_uint;
#[doc = " @brief Session Key computation algorithms\n"]
pub use self::sl_wfx_secure_link_session_key_alg_e as sl_wfx_secure_link_session_key_alg_t;
#[doc = " @brief Exchange Secure Link Public Keys\n\n This API is used by the Host to send its *curve25519* public key to Device, and get back Device public key in the confirmation message.\n Once keys are exchanged and authenticated (using their respective MAC), each peer computes the Secure Link *session key* that will be used\n to encrypt/decrypt future Host<->Device messages."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_exchange_pub_keys_req_body_s {
    #[doc = "<Choice of the cryptographic algorithm used in the session key computation (see enum sl_wfx_secure_link_session_key_alg_t)"]
    pub algorithm: u32,
    #[doc = "<Host Public Key"]
    pub host_pub_key: [u8; 32usize],
    #[doc = "<Host Public Key MAC"]
    pub host_pub_key_mac: [u8; 64usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_exchange_pub_keys_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_exchange_pub_keys_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_exchange_pub_keys_req_body_s>(),
        100usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_exchange_pub_keys_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).algorithm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_body_s),
            "::",
            stringify!(algorithm)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_pub_key) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_body_s),
            "::",
            stringify!(host_pub_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host_pub_key_mac) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_body_s),
            "::",
            stringify!(host_pub_key_mac)
        )
    );
}
#[doc = " @brief Exchange Secure Link Public Keys\n\n This API is used by the Host to send its *curve25519* public key to Device, and get back Device public key in the confirmation message.\n Once keys are exchanged and authenticated (using their respective MAC), each peer computes the Secure Link *session key* that will be used\n to encrypt/decrypt future Host<->Device messages."]
pub type sl_wfx_securelink_exchange_pub_keys_req_body_t =
    sl_wfx_securelink_exchange_pub_keys_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_exchange_pub_keys_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_securelink_exchange_pub_keys_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_exchange_pub_keys_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_exchange_pub_keys_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_exchange_pub_keys_req_s>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_exchange_pub_keys_req_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_securelink_exchange_pub_keys_req_t = sl_wfx_securelink_exchange_pub_keys_req_s;
#[doc = " @brief Confirmation for exchange of Secure Link Public Keys"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_exchange_pub_keys_cnf_body_s {
    #[doc = "<Request status (see enum sl_wfx_status_t)"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_exchange_pub_keys_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_exchange_pub_keys_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_exchange_pub_keys_cnf_body_s>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_exchange_pub_keys_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation for exchange of Secure Link Public Keys"]
pub type sl_wfx_securelink_exchange_pub_keys_cnf_body_t =
    sl_wfx_securelink_exchange_pub_keys_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_exchange_pub_keys_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_securelink_exchange_pub_keys_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_exchange_pub_keys_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_exchange_pub_keys_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_exchange_pub_keys_cnf_s>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_exchange_pub_keys_cnf_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_securelink_exchange_pub_keys_cnf_t = sl_wfx_securelink_exchange_pub_keys_cnf_s;
#[doc = " @brief Indication for exchange of Secure Link Public Keys"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_exchange_pub_keys_ind_body_s {
    #[doc = "<Request status (see enum sl_wfx_status_t)"]
    pub status: u32,
    #[doc = "<Device Public Key"]
    pub ncp_pub_key: [u8; 32usize],
    #[doc = "<Device Public Key MAC"]
    pub ncp_pub_key_mac: [u8; 64usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_exchange_pub_keys_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_exchange_pub_keys_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_exchange_pub_keys_ind_body_s>(),
        100usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_exchange_pub_keys_ind_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_body_s),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ncp_pub_key) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_body_s),
            "::",
            stringify!(ncp_pub_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ncp_pub_key_mac) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_body_s),
            "::",
            stringify!(ncp_pub_key_mac)
        )
    );
}
#[doc = " @brief Indication for exchange of Secure Link Public Keys"]
pub type sl_wfx_securelink_exchange_pub_keys_ind_body_t =
    sl_wfx_securelink_exchange_pub_keys_ind_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_exchange_pub_keys_ind_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_securelink_exchange_pub_keys_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_exchange_pub_keys_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_exchange_pub_keys_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_exchange_pub_keys_ind_s>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_exchange_pub_keys_ind_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_exchange_pub_keys_ind_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_securelink_exchange_pub_keys_ind_t = sl_wfx_securelink_exchange_pub_keys_ind_s;
#[doc = " @brief Configure Secure Link Layer\n\n This API can be used to:\n - Set/update the Secure Link *encryption bitmap*\n - Disable Session Key Protection\n\n About the Session Key protection:\n SecureLink underlying encryption algorithm is AES CCM. This algorithm is using an internal Nonce counter incremented each time a message is\n encrypted/decrypted. This counter is not supposed to go beyond a given limit to guarantee AES CCM security properties.\n This is why Host Driver is responsible for renegotiating the session key once the message counter is approaching the limit.\n Disabling the Session Key protection will disable the check performed by the firmware that the Nonce counter is crossing the limit,\n allowing Host Driver to use the same session key during the same power cycle, even during a very long time.\n This behavior is not recommended.\n\n To disable the protection, a given magic word (SL_WFX_SESSION_KEY_PROTECTION_DISABLE_MAGIC) must be provided as _DisableSessionKeyProtection_ parameter value. Any other value will let the protection set.\n\n @note When SecureLink is activated, _SL Configure_ API must be called right after the key exchange. Issuing another command instead will result in an error.\n @note It is not recommended to call this API a second time during the same power cycle."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_configure_req_body_s {
    #[doc = "<Encryption bitmap"]
    pub encr_bmp: [u8; 32usize],
    #[doc = "<Force the firmware to authorize the use of the same session key during a complete power cycle, even very long. NOT RECOMMENDED"]
    pub disable_session_key_protection: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_configure_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_configure_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_configure_req_body_s>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_configure_req_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_configure_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_configure_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encr_bmp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_req_body_s),
            "::",
            stringify!(encr_bmp)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).disable_session_key_protection) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_req_body_s),
            "::",
            stringify!(disable_session_key_protection)
        )
    );
}
#[doc = " @brief Configure Secure Link Layer\n\n This API can be used to:\n - Set/update the Secure Link *encryption bitmap*\n - Disable Session Key Protection\n\n About the Session Key protection:\n SecureLink underlying encryption algorithm is AES CCM. This algorithm is using an internal Nonce counter incremented each time a message is\n encrypted/decrypted. This counter is not supposed to go beyond a given limit to guarantee AES CCM security properties.\n This is why Host Driver is responsible for renegotiating the session key once the message counter is approaching the limit.\n Disabling the Session Key protection will disable the check performed by the firmware that the Nonce counter is crossing the limit,\n allowing Host Driver to use the same session key during the same power cycle, even during a very long time.\n This behavior is not recommended.\n\n To disable the protection, a given magic word (SL_WFX_SESSION_KEY_PROTECTION_DISABLE_MAGIC) must be provided as _DisableSessionKeyProtection_ parameter value. Any other value will let the protection set.\n\n @note When SecureLink is activated, _SL Configure_ API must be called right after the key exchange. Issuing another command instead will result in an error.\n @note It is not recommended to call this API a second time during the same power cycle."]
pub type sl_wfx_securelink_configure_req_body_t = sl_wfx_securelink_configure_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_configure_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_securelink_configure_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_configure_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_configure_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_configure_req_s>(),
        40usize,
        concat!("Size of: ", stringify!(sl_wfx_securelink_configure_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_configure_req_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_configure_req_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_securelink_configure_req_t = sl_wfx_securelink_configure_req_s;
#[doc = " @brief Confirmation of Secure Link Layer configuration sl_wfx_securelink_configure_req_body_t\n\n @return HI_STATUS_SUCCESS\n\n @note The host driver should wait for this confirmation to update its local bitmap with the returned value"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_configure_cnf_body_s {
    #[doc = "<Request status (see enum sl_wfx_status_t)"]
    pub status: u32,
    #[doc = "<Encryption bitmap"]
    pub encr_bmp: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_configure_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_configure_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_configure_cnf_body_s>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_securelink_configure_cnf_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_configure_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_configure_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encr_bmp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_cnf_body_s),
            "::",
            stringify!(encr_bmp)
        )
    );
}
#[doc = " @brief Confirmation of Secure Link Layer configuration sl_wfx_securelink_configure_req_body_t\n\n @return HI_STATUS_SUCCESS\n\n @note The host driver should wait for this confirmation to update its local bitmap with the returned value"]
pub type sl_wfx_securelink_configure_cnf_body_t = sl_wfx_securelink_configure_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_securelink_configure_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_securelink_configure_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_securelink_configure_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_securelink_configure_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_securelink_configure_cnf_s>(),
        40usize,
        concat!("Size of: ", stringify!(sl_wfx_securelink_configure_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_securelink_configure_cnf_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_securelink_configure_cnf_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_securelink_configure_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_securelink_configure_cnf_t = sl_wfx_securelink_configure_cnf_s;
#[doc = "@brief Prevent Rollback request\n\n *Prevent Rollback* asks WLAN firmware to burn a new *Firmware Rollback* value in a dedicated OTP section.\n\n The new value is encoded in the firmware itself. After it is burned, this value will prevent from starting\n  all firmwares whose internal rollback value is lower than the OTP value.\n\n *Magic Word* is used to prevent mistakenly sent requests from burning the OTP.\n"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_prevent_rollback_req_body_s {
    #[doc = "<Magic Word - should be 0x5C8912F3"]
    pub magic_word: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_prevent_rollback_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_prevent_rollback_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_prevent_rollback_req_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_prevent_rollback_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_prevent_rollback_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_prevent_rollback_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).magic_word) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_prevent_rollback_req_body_s),
            "::",
            stringify!(magic_word)
        )
    );
}
#[doc = "@brief Prevent Rollback request\n\n *Prevent Rollback* asks WLAN firmware to burn a new *Firmware Rollback* value in a dedicated OTP section.\n\n The new value is encoded in the firmware itself. After it is burned, this value will prevent from starting\n  all firmwares whose internal rollback value is lower than the OTP value.\n\n *Magic Word* is used to prevent mistakenly sent requests from burning the OTP.\n"]
pub type sl_wfx_prevent_rollback_req_body_t = sl_wfx_prevent_rollback_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_prevent_rollback_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_prevent_rollback_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_prevent_rollback_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_prevent_rollback_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_prevent_rollback_req_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_prevent_rollback_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_prevent_rollback_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_prevent_rollback_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_prevent_rollback_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_prevent_rollback_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_prevent_rollback_req_t = sl_wfx_prevent_rollback_req_s;
#[doc = " @brief Confirmation of the *Prevent Rollback* request\n\n The request might have failed for the following reasons:\n - Wrong *magic word* value\n"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_prevent_rollback_cnf_body_s {
    #[doc = "<Confirmation status, see enum sl_wfx_status_t"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_prevent_rollback_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_prevent_rollback_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_prevent_rollback_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_prevent_rollback_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_prevent_rollback_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_prevent_rollback_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_prevent_rollback_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation of the *Prevent Rollback* request\n\n The request might have failed for the following reasons:\n - Wrong *magic word* value\n"]
pub type sl_wfx_prevent_rollback_cnf_body_t = sl_wfx_prevent_rollback_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_prevent_rollback_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_prevent_rollback_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_prevent_rollback_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_prevent_rollback_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_prevent_rollback_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_prevent_rollback_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_prevent_rollback_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_prevent_rollback_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_prevent_rollback_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_prevent_rollback_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_prevent_rollback_cnf_t = sl_wfx_prevent_rollback_cnf_s;
#[doc = "< PTA 1-wire interface with WLAN master on PTA_TX_CONF pin (GRANT signal),"]
pub const sl_wfx_pta_mode_e_SL_WFX_PTA_1W_WLAN_MASTER: sl_wfx_pta_mode_e = 0;
#[doc = "< PTA 1-wire interface with COEX master on PTA_RF_ACT pin (REQUEST signal),"]
pub const sl_wfx_pta_mode_e_SL_WFX_PTA_1W_COEX_MASTER: sl_wfx_pta_mode_e = 1;
#[doc = "< PTA 2-wire interface on PTA_RF_ACT and PTA_TX_CONF pins (respectively REQUEST and GRANT signals),"]
pub const sl_wfx_pta_mode_e_SL_WFX_PTA_2W: sl_wfx_pta_mode_e = 2;
#[doc = "< PTA 3-wire interface on same pins as SL_WFX_PTA_2W, plus PTA_STATUS pin (PRIORITY signal)"]
pub const sl_wfx_pta_mode_e_SL_WFX_PTA_3W: sl_wfx_pta_mode_e = 3;
#[doc = "< PTA 4-wire interface on same pins as SL_WFX_PTA_3W, plus PTA_FREQ pin (FREQ signal)."]
pub const sl_wfx_pta_mode_e_SL_WFX_PTA_4W: sl_wfx_pta_mode_e = 4;
#[doc = " @brief PTA modes."]
pub type sl_wfx_pta_mode_e = c_types::c_uint;
#[doc = " @brief PTA modes."]
pub use self::sl_wfx_pta_mode_e as sl_wfx_pta_mode_t;
#[doc = "< Signal level is low"]
pub const sl_wfx_signal_level_e_SL_WFX_SIGNAL_LOW: sl_wfx_signal_level_e = 0;
#[doc = "< Signal level is high"]
pub const sl_wfx_signal_level_e_SL_WFX_SIGNAL_HIGH: sl_wfx_signal_level_e = 1;
#[doc = " @brief Signal levels."]
pub type sl_wfx_signal_level_e = c_types::c_uint;
#[doc = " @brief Signal levels."]
pub use self::sl_wfx_signal_level_e as sl_wfx_signal_level_t;
#[doc = "< IEEE 802.15.4 standards ZigBee SDK, Thread SDK, and so on."]
pub const sl_wfx_coex_type_e_SL_WFX_COEX_TYPE_GENERIC: sl_wfx_coex_type_e = 0;
#[doc = "< Bluetooth Low-Energy Stack"]
pub const sl_wfx_coex_type_e_SL_WFX_COEX_TYPE_BLE: sl_wfx_coex_type_e = 1;
#[doc = " @brief Coexistence types supported by PTA."]
pub type sl_wfx_coex_type_e = c_types::c_uint;
#[doc = " @brief Coexistence types supported by PTA."]
pub use self::sl_wfx_coex_type_e as sl_wfx_coex_type_t;
#[doc = "< WLAN has the RF, Coex is not allowed to transmit"]
pub const sl_wfx_grant_state_e_SL_WFX_NO_GRANT: sl_wfx_grant_state_e = 0;
#[doc = "< Coex is granted"]
pub const sl_wfx_grant_state_e_SL_WFX_GRANT: sl_wfx_grant_state_e = 1;
#[doc = " @brief Grant states."]
pub type sl_wfx_grant_state_e = c_types::c_uint;
#[doc = " @brief Grant states."]
pub use self::sl_wfx_grant_state_e as sl_wfx_grant_state_t;
#[doc = " @brief Request sent by the host to set the PTA mode, the active levels on signals, the Coex type,\n to define the timings, quotas, combined mode and default grant state.\n\n Depending on specified PTA mode, every setting is not necessarily used and can then be set to '0'.<br/>\n The following table indicates the PTA mode for which the setting is significant.<br/>\n Combined mode is activated during concurrent RX (WLAN and Coex) requests and if SimultaneousRxAccesses is set to '1'.\n\n | Settings                 | 1-wire WLAN Master | 1-wire Coex Master | 2-wire | 3-wire | 3-wire (combined) | 4-wire | 4-wire (combined) |\n |--------------------------|:------------------:|:------------------:|:------:|:------:|:-----------------:|:------:|:-----------------:|\n | PrioritySamplingTime     |                    |                    |        |    x   |          x        |    x   |          x        |\n | TxRxSamplingTime         |                    |                    |        |        |          x        |        |          x        |\n | FreqSamplingTime         |                    |                    |        |        |                   |    x   |          x        |\n | GrantValidTime           |                    |                    |        |    x   |          x        |    x   |          x        |\n | FemControlTime           |                    |                    |        |    x   |          x        |    x   |          x        |\n | FirstSlotTime            |                    |                    |        |        |          x        |        |          x        |\n | PeriodicTxRxSamplingTime |                    |                    |        |        |          x        |        |          x        |\n | CoexQuota                |         x          |                    |    x   |        |                   |        |                   |\n | WlanQuota                |         x          |                    |    x   |        |                   |        |                   |\n\n <br/>\n @image html 3w-timings-sequence.svg \"Sequence diagram with 3-wire PTA mode\"\n <br/>\n @image html 4w-timings-sequence.svg \"Sequence diagram with 4-wire PTA mode\"\n\n @note Request will fail if PTA is started.\n\n @warning\n The following assertions must be respected:\n - priority_sampling_time < tx_rx_sampling_time < grant_valid_time <= first_slot_time\n - freq_sampling_time < grant_valid_time < fem_control_time"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_settings_req_body_s {
    #[doc = "< The PTA mode, see enum ::sl_wfx_pta_mode_t"]
    pub pta_mode: u8,
    #[doc = "< Active level on REQUEST signal (PTA_RF_ACT pin), provided by Coex to request the RF, see enum ::sl_wfx_signal_level_t"]
    pub request_signal_active_level: u8,
    #[doc = "< Active level on PRIORITY signal (PTA_STATUS pin), provided by Coex to set the priority of the request, see enum ::sl_wfx_signal_level_t"]
    pub priority_signal_active_level: u8,
    #[doc = "< Active level on FREQ signal (PTA_FREQ pin), provided by Coex in 4-wire mode when Coex and WLAN share the same band, see enum ::sl_wfx_signal_level_t"]
    pub freq_signal_active_level: u8,
    #[doc = "< Active level on GRANT signal (PTA_TX_CONF pin), generated by PTA to grant the RF to Coex, see enum ::sl_wfx_signal_level_t"]
    pub grant_signal_active_level: u8,
    #[doc = "< The Coex type, see enum ::sl_wfx_coex_type_t"]
    pub coex_type: u8,
    #[doc = "< The state of the GRANT signal before arbitration at grant_valid_time, see enum ::sl_wfx_grant_state_t"]
    pub default_grant_state: u8,
    #[doc = "< Boolean to allow both Coex and WLAN to receive concurrently, also named combined mode"]
    pub simultaneous_rx_access: u8,
    #[doc = "< The time (in microseconds) from the Coex request to the sampling of the priority on PRIORITY signal (1 to 31)"]
    pub priority_sampling_time: u8,
    #[doc = "< The time (in microseconds) from the Coex request to the sampling of the directionality on PRIORITY signal (priority_sampling_time to 63)"]
    pub tx_rx_sampling_time: u8,
    #[doc = "< The time (in microseconds) from the Coex request to the sampling of freq-match information on FREQ signal (1 to 127)"]
    pub freq_sampling_time: u8,
    #[doc = "< The time (in microseconds) from Coex request to the GRANT signal assertion (MAX(tx_rx_sampling_time, freq_sampling_time) to 255)"]
    pub grant_valid_time: u8,
    #[doc = "< The time (in microseconds) from Coex request to the control of FEM (grant_valid_time to 255)"]
    pub fem_control_time: u8,
    #[doc = "< The time (in microseconds) from the Coex request to the beginning of reception or transmission (grant_valid_time to 255)"]
    pub first_slot_time: u8,
    #[doc = "< The period (in microseconds) from first_slot_time of following samplings of the directionality on PRIORITY signal (1 to 1023)"]
    pub periodic_tx_rx_sampling_time: u16,
    #[doc = "< The duration (in microseconds) for which RF is granted to Coex before it is moved to WLAN"]
    pub coex_quota: u16,
    #[doc = "< The duration (in microseconds) for which RF is granted to WLAN before it is moved to Coex"]
    pub wlan_quota: u16,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_settings_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_settings_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_settings_req_body_s>(),
        20usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_settings_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_settings_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_settings_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pta_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(pta_mode)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).request_signal_active_level) as usize - ptr as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(request_signal_active_level)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).priority_signal_active_level) as usize - ptr as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(priority_signal_active_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).freq_signal_active_level) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(freq_signal_active_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).grant_signal_active_level) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(grant_signal_active_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_type) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(coex_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).default_grant_state) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(default_grant_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).simultaneous_rx_access) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(simultaneous_rx_access)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).priority_sampling_time) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(priority_sampling_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_rx_sampling_time) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(tx_rx_sampling_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).freq_sampling_time) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(freq_sampling_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).grant_valid_time) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(grant_valid_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fem_control_time) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(fem_control_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).first_slot_time) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(first_slot_time)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).periodic_tx_rx_sampling_time) as usize - ptr as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(periodic_tx_rx_sampling_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).coex_quota) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(coex_quota)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wlan_quota) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_body_s),
            "::",
            stringify!(wlan_quota)
        )
    );
}
#[doc = " @brief Request sent by the host to set the PTA mode, the active levels on signals, the Coex type,\n to define the timings, quotas, combined mode and default grant state.\n\n Depending on specified PTA mode, every setting is not necessarily used and can then be set to '0'.<br/>\n The following table indicates the PTA mode for which the setting is significant.<br/>\n Combined mode is activated during concurrent RX (WLAN and Coex) requests and if SimultaneousRxAccesses is set to '1'.\n\n | Settings                 | 1-wire WLAN Master | 1-wire Coex Master | 2-wire | 3-wire | 3-wire (combined) | 4-wire | 4-wire (combined) |\n |--------------------------|:------------------:|:------------------:|:------:|:------:|:-----------------:|:------:|:-----------------:|\n | PrioritySamplingTime     |                    |                    |        |    x   |          x        |    x   |          x        |\n | TxRxSamplingTime         |                    |                    |        |        |          x        |        |          x        |\n | FreqSamplingTime         |                    |                    |        |        |                   |    x   |          x        |\n | GrantValidTime           |                    |                    |        |    x   |          x        |    x   |          x        |\n | FemControlTime           |                    |                    |        |    x   |          x        |    x   |          x        |\n | FirstSlotTime            |                    |                    |        |        |          x        |        |          x        |\n | PeriodicTxRxSamplingTime |                    |                    |        |        |          x        |        |          x        |\n | CoexQuota                |         x          |                    |    x   |        |                   |        |                   |\n | WlanQuota                |         x          |                    |    x   |        |                   |        |                   |\n\n <br/>\n @image html 3w-timings-sequence.svg \"Sequence diagram with 3-wire PTA mode\"\n <br/>\n @image html 4w-timings-sequence.svg \"Sequence diagram with 4-wire PTA mode\"\n\n @note Request will fail if PTA is started.\n\n @warning\n The following assertions must be respected:\n - priority_sampling_time < tx_rx_sampling_time < grant_valid_time <= first_slot_time\n - freq_sampling_time < grant_valid_time < fem_control_time"]
pub type sl_wfx_pta_settings_req_body_t = sl_wfx_pta_settings_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_settings_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_pta_settings_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_settings_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_settings_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_settings_req_s>(),
        24usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_settings_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_settings_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_settings_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_pta_settings_req_t = sl_wfx_pta_settings_req_s;
#[doc = " @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_SETTINGS_REQ_ID request."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_settings_cnf_body_s {
    #[doc = "< Confirmation status, see enum ::sl_wfx_status_t"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_settings_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_settings_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_settings_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_settings_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_settings_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_settings_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_SETTINGS_REQ_ID request."]
pub type sl_wfx_pta_settings_cnf_body_t = sl_wfx_pta_settings_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_settings_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_pta_settings_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_settings_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_settings_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_settings_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_settings_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_settings_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_settings_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_settings_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_pta_settings_cnf_t = sl_wfx_pta_settings_cnf_s;
#[doc = "< Maximizes priority to COEX"]
pub const sl_wfx_pta_priority_e_SL_WFX_PTA_PRIORITY_COEX_MAXIMIZED: sl_wfx_pta_priority_e = 1378;
#[doc = "< High priority to COEX, targets low-latency to COEX"]
pub const sl_wfx_pta_priority_e_SL_WFX_PTA_PRIORITY_COEX_HIGH: sl_wfx_pta_priority_e = 1122;
#[doc = "< Balanced PTA arbitration"]
pub const sl_wfx_pta_priority_e_SL_WFX_PTA_PRIORITY_BALANCED: sl_wfx_pta_priority_e = 5217;
#[doc = "< High priority to WLAN, protects WLAN transmissions"]
pub const sl_wfx_pta_priority_e_SL_WFX_PTA_PRIORITY_WLAN_HIGH: sl_wfx_pta_priority_e = 6225;
#[doc = "< Maximizes priority to WLAN"]
pub const sl_wfx_pta_priority_e_SL_WFX_PTA_PRIORITY_WLAN_MAXIMIZED: sl_wfx_pta_priority_e = 6737;
#[doc = " @brief Priority levels used by PTA for concurrent (Coex and WLAN) request arbitration."]
pub type sl_wfx_pta_priority_e = c_types::c_uint;
#[doc = " @brief Priority levels used by PTA for concurrent (Coex and WLAN) request arbitration."]
pub use self::sl_wfx_pta_priority_e as sl_wfx_pta_priority_t;
#[doc = " @brief Request sent by the host to define the level of priority used to arbitrate concurrent Coex and WLAN requests.\n\n Priority can be one value from enum ::sl_wfx_pta_priority_t but can also be an integer value whom definition is the following bitfield:\n\n @code{.c}\n struct sl_wfx_pta_priority_s\n {\n   uint32_t coex_prio_low:3;    // Priority given to Coex for low-priority requests\n   uint32_t reserved_1:1;       // Reserved for future use\n   uint32_t coex_prio_high:3;   // Priority given to Coex for high-priority requests\n   uint32_t reserved_2:1;       // Reserved for future use\n   uint32_t grant_coex:1;       // Allows Coex to override WLAN\n   uint32_t grant_wlan:1;       // Allows WLAN to override Coex whenever WLAN is not idle\n   uint32_t protect_coex:1;     // WLAN grant is delayed until Coex has finished its present granted transaction\n   uint32_t protect_wlan_tx:1;  // Prevents Coex from being granted when WLAN is transmitting (the protection is also extended to the response)\n   uint32_t protect_wlan_rx:1;  // Prevents Coex from being granted when WLAN is receiving or waiting for a response to an already transmitted frame\n   uint32_t reserved_3:19;      // Reserved for future use\n }\n @endcode\n\n @note Request will fail if PTA is started."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_priority_req_body_s {
    #[doc = "< The priority level, see enum ::sl_wfx_pta_priority_t"]
    pub priority: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_priority_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_priority_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_priority_req_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_priority_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_priority_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_priority_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_priority_req_body_s),
            "::",
            stringify!(priority)
        )
    );
}
#[doc = " @brief Request sent by the host to define the level of priority used to arbitrate concurrent Coex and WLAN requests.\n\n Priority can be one value from enum ::sl_wfx_pta_priority_t but can also be an integer value whom definition is the following bitfield:\n\n @code{.c}\n struct sl_wfx_pta_priority_s\n {\n   uint32_t coex_prio_low:3;    // Priority given to Coex for low-priority requests\n   uint32_t reserved_1:1;       // Reserved for future use\n   uint32_t coex_prio_high:3;   // Priority given to Coex for high-priority requests\n   uint32_t reserved_2:1;       // Reserved for future use\n   uint32_t grant_coex:1;       // Allows Coex to override WLAN\n   uint32_t grant_wlan:1;       // Allows WLAN to override Coex whenever WLAN is not idle\n   uint32_t protect_coex:1;     // WLAN grant is delayed until Coex has finished its present granted transaction\n   uint32_t protect_wlan_tx:1;  // Prevents Coex from being granted when WLAN is transmitting (the protection is also extended to the response)\n   uint32_t protect_wlan_rx:1;  // Prevents Coex from being granted when WLAN is receiving or waiting for a response to an already transmitted frame\n   uint32_t reserved_3:19;      // Reserved for future use\n }\n @endcode\n\n @note Request will fail if PTA is started."]
pub type sl_wfx_pta_priority_req_body_t = sl_wfx_pta_priority_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_priority_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_pta_priority_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_priority_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_priority_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_priority_req_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_priority_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_priority_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_priority_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_priority_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_priority_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_pta_priority_req_t = sl_wfx_pta_priority_req_s;
#[doc = " @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_PRIORITY_REQ_ID request."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_priority_cnf_body_s {
    #[doc = "< Confirmation status, see enum ::sl_wfx_status_t"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_priority_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_priority_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_priority_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_priority_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_priority_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_priority_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_priority_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_PRIORITY_REQ_ID request."]
pub type sl_wfx_pta_priority_cnf_body_t = sl_wfx_pta_priority_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_priority_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_pta_priority_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_priority_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_priority_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_priority_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_priority_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_priority_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_priority_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_priority_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_priority_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_pta_priority_cnf_t = sl_wfx_pta_priority_cnf_s;
#[doc = "< PTA is off"]
pub const sl_wfx_pta_state_e_SL_WFX_PTA_OFF: sl_wfx_pta_state_e = 0;
#[doc = "< PTA is on"]
pub const sl_wfx_pta_state_e_SL_WFX_PTA_ON: sl_wfx_pta_state_e = 1;
#[doc = " @brief PTA states."]
pub type sl_wfx_pta_state_e = c_types::c_uint;
#[doc = " @brief PTA states."]
pub use self::sl_wfx_pta_state_e as sl_wfx_pta_state_t;
#[doc = " @brief Request sent by host to start or stop the PTA.\n @note Starting PTA will fail if not first configured with ::sl_wfx_pta_settings_req_body_t request."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_state_req_body_s {
    #[doc = "< Requested PTA state, see enum ::sl_wfx_pta_state_t"]
    pub pta_state: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_state_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_state_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_state_req_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_state_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_state_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_state_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pta_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_state_req_body_s),
            "::",
            stringify!(pta_state)
        )
    );
}
#[doc = " @brief Request sent by host to start or stop the PTA.\n @note Starting PTA will fail if not first configured with ::sl_wfx_pta_settings_req_body_t request."]
pub type sl_wfx_pta_state_req_body_t = sl_wfx_pta_state_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_state_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_pta_state_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_state_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_state_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_state_req_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_state_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_state_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_state_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_state_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_state_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_pta_state_req_t = sl_wfx_pta_state_req_s;
#[doc = " @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_STATE_REQ_ID request."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_state_cnf_body_s {
    #[doc = "< Confirmation status, see enum ::sl_wfx_status_t"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_state_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_state_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_state_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_state_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_state_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_state_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_state_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation sent by WLAN firmware after a ::SL_WFX_PTA_STATE_REQ_ID request."]
pub type sl_wfx_pta_state_cnf_body_t = sl_wfx_pta_state_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_pta_state_cnf_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_pta_state_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_pta_state_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_pta_state_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_pta_state_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_pta_state_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_pta_state_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_pta_state_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_state_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_pta_state_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_pta_state_cnf_t = sl_wfx_pta_state_cnf_s;
#[doc = "< Use CCA defer threshold relative to channel noise"]
pub const sl_wfx_cc_thr_mode_e_SL_WFX_CCA_THR_MODE_RELATIVE: sl_wfx_cc_thr_mode_e = 0;
#[doc = "< Use absolute CCA defer threshold"]
pub const sl_wfx_cc_thr_mode_e_SL_WFX_CCA_THR_MODE_ABSOLUTE: sl_wfx_cc_thr_mode_e = 1;
#[doc = " @brief CCA Mode definition"]
pub type sl_wfx_cc_thr_mode_e = c_types::c_uint;
#[doc = " @brief CCA Mode definition"]
pub use self::sl_wfx_cc_thr_mode_e as sl_wfx_cc_thr_mode_t;
#[doc = " @brief Request sent by host to set the Clear Channel Assessment configuration\n Set the CCA mode and the defer threshold"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_cca_config_req_body_s {
    #[doc = "< CCA threshold mode. See enum ::sl_wfx_cc_thr_mode_t."]
    pub cca_thr_mode: u8,
    #[doc = "< reserved for future use, set to 0"]
    pub reserved: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_set_cca_config_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_cca_config_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_cca_config_req_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_set_cca_config_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_cca_config_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_cca_config_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cca_thr_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_req_body_s),
            "::",
            stringify!(cca_thr_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_req_body_s),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " @brief Request sent by host to set the Clear Channel Assessment configuration\n Set the CCA mode and the defer threshold"]
pub type sl_wfx_set_cca_config_req_body_t = sl_wfx_set_cca_config_req_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_cca_config_req_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_set_cca_config_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_cca_config_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_cca_config_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_cca_config_req_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_cca_config_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_cca_config_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_cca_config_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_req_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_set_cca_config_req_t = sl_wfx_set_cca_config_req_s;
#[doc = " @brief Confirmation sent by Wlan firmware after a ::SL_WFX_SET_CCA_CONFIG_REQ_ID request."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_cca_config_cnf_body_s {
    #[doc = "< Confirmation status, see enum ::sl_wfx_status_t"]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_cca_config_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_cca_config_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_cca_config_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_set_cca_config_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_cca_config_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_cca_config_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation sent by Wlan firmware after a ::SL_WFX_SET_CCA_CONFIG_REQ_ID request."]
pub type sl_wfx_set_cca_config_cnf_body_t = sl_wfx_set_cca_config_cnf_body_s;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_cca_config_s {
    pub header: sl_wfx_header_t,
    pub body: sl_wfx_set_cca_config_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_cca_config_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_cca_config_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_cca_config_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_cca_config_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_cca_config_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_cca_config_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_cca_config_s),
            "::",
            stringify!(body)
        )
    );
}
pub type sl_wfx_set_cca_config_t = sl_wfx_set_cca_config_s;
#[doc = "< \\b SET_MAC_ADDRESS request ID uses body SL_WFX_SET_MAC_ADDRESS_REQ_BODY and returns SL_WFX_SET_MAC_ADDRESS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_MAC_ADDRESS_REQ_ID: sl_wfx_requests_ids_e = 66;
#[doc = "< \\b CONNECT request ID uses body SL_WFX_CONNECT_REQ_BODY and returns SL_WFX_CONNECT_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_CONNECT_REQ_ID: sl_wfx_requests_ids_e = 67;
#[doc = "< \\b DISCONNECT request ID uses body SL_WFX_DISCONNECT_REQ_BODY and returns SL_WFX_DISCONNECT_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_DISCONNECT_REQ_ID: sl_wfx_requests_ids_e = 68;
#[doc = "< \\b START_AP request ID uses body SL_WFX_START_AP_REQ_BODY and returns SL_WFX_START_AP_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_START_AP_REQ_ID: sl_wfx_requests_ids_e = 69;
#[doc = "< \\b UPDATE_AP request ID uses body SL_WFX_UPDATE_AP_REQ_BODY and returns SL_WFX_UPDATE_AP_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_UPDATE_AP_REQ_ID: sl_wfx_requests_ids_e = 70;
#[doc = "< \\b STOP_AP request ID uses body SL_WFX_STOP_AP_REQ_BODY and returns SL_WFX_STOP_AP_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_STOP_AP_REQ_ID: sl_wfx_requests_ids_e = 71;
#[doc = "< \\b SEND_FRAME request ID uses body SL_WFX_SEND_FRAME_REQ_BODY and returns SL_WFX_SEND_FRAME_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SEND_FRAME_REQ_ID: sl_wfx_requests_ids_e = 74;
#[doc = "< \\b START_SCAN request ID uses body SL_WFX_START_SCAN_REQ_BODY and returns SL_WFX_START_SCAN_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_START_SCAN_REQ_ID: sl_wfx_requests_ids_e = 75;
#[doc = "< \\b STOP_SCAN request ID uses body SL_WFX_STOP_SCAN_REQ_BODY and returns SL_WFX_STOP_SCAN_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_STOP_SCAN_REQ_ID: sl_wfx_requests_ids_e = 76;
#[doc = "< \\b GET_SIGNAL_STRENGTH request ID uses body SL_WFX_GET_SIGNAL_STRENGTH_REQ_BODY and returns SL_WFX_GET_SIGNAL_STRENGTH_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_GET_SIGNAL_STRENGTH_REQ_ID: sl_wfx_requests_ids_e = 78;
#[doc = "< \\b DISCONNECT_AP_CLIENT request ID uses body SL_WFX_DISCONNECT_AP_CLIENT_REQ_BODY and returns SL_WFX_DISCONNECT_AP_CLIENT_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_DISCONNECT_AP_CLIENT_REQ_ID: sl_wfx_requests_ids_e = 79;
#[doc = "< \\b SET_PM_MODE request ID uses body SL_WFX_SET_PM_MODE_REQ_BODY and returns SL_WFX_SET_PM_MODE_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_PM_MODE_REQ_ID: sl_wfx_requests_ids_e = 82;
#[doc = "< \\b ADD_MULTICAST_ADDR request ID uses body SL_WFX_ADD_MULTICAST_ADDR_REQ_BODY and returns SL_WFX_ADD_MULTICAST_ADDR_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_ADD_MULTICAST_ADDR_REQ_ID: sl_wfx_requests_ids_e = 83;
#[doc = "< \\b REMOVE_MULTICAST_ADDR request ID uses body SL_WFX_REMOVE_MULTICAST_ADDR_REQ_BODY and returns SL_WFX_REMOVE_MULTICAST_ADDR_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_REMOVE_MULTICAST_ADDR_REQ_ID: sl_wfx_requests_ids_e = 84;
#[doc = "< \\b SET_MAX_AP_CLIENT_COUNT request ID uses body SL_WFX_SET_MAX_AP_CLIENT_COUNT_REQ_BODY and returns SL_WFX_SET_MAX_AP_CLIENT_COUNT_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_MAX_AP_CLIENT_COUNT_REQ_ID: sl_wfx_requests_ids_e = 85;
#[doc = "< \\b SET_MAX_AP_CLIENT_INACTIVITY request ID uses body SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_REQ_BODY and returns SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_REQ_ID: sl_wfx_requests_ids_e =
    86;
#[doc = "< \\b SET_ROAM_PARAMETERS request ID uses body SL_WFX_SET_ROAM_PARAMETERS_REQ_BODY and returns SL_WFX_SET_ROAM_PARAMETERS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_ROAM_PARAMETERS_REQ_ID: sl_wfx_requests_ids_e = 87;
#[doc = "< \\b SET_TX_RATE_PARAMETERS request ID uses body SL_WFX_SET_TX_RATE_PARAMETERS_REQ_BODY and returns SL_WFX_SET_TX_RATE_PARAMETERS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_TX_RATE_PARAMETERS_REQ_ID: sl_wfx_requests_ids_e = 88;
#[doc = "< \\b SET_ARP_IP_ADDRESS request ID uses body SL_WFX_SET_ARP_IP_ADDRESS_REQ_BODY and returns SL_WFX_SET_ARP_IP_ADDRESS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_ARP_IP_ADDRESS_REQ_ID: sl_wfx_requests_ids_e = 89;
#[doc = "< \\b SET_NS_IP_ADDRESS request ID uses body SL_WFX_SET_NS_IP_ADDRESS_REQ_BODY and returns SL_WFX_SET_NS_IP_ADDRESS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_NS_IP_ADDRESS_REQ_ID: sl_wfx_requests_ids_e = 90;
#[doc = "< \\b SET_BROADCAST_FILTER request ID uses body SL_WFX_SET_BROADCAST_FILTER_REQ_BODY and returns SL_WFX_SET_BROADCAST_FILTER_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_BROADCAST_FILTER_REQ_ID: sl_wfx_requests_ids_e = 91;
#[doc = "< \\b SET_SCAN_PARAMETERS request ID uses body SL_WFX_SET_SCAN_PARAMETERS_REQ_BODY and returns SL_WFX_SET_SCAN_PARAMETERS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_SCAN_PARAMETERS_REQ_ID: sl_wfx_requests_ids_e = 92;
#[doc = "< \\b SET_UNICAST_FILTER request ID uses body SL_WFX_SET_UNICAST_FILTER_REQ_BODY and returns SL_WFX_SET_UNICAST_FILTER_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_UNICAST_FILTER_REQ_ID: sl_wfx_requests_ids_e = 93;
#[doc = "< \\b ADD_WHITELIST_ADDR request ID uses body SL_WFX_ADD_WHITELIST_ADDR_REQ_BODY and returns SL_WFX_ADD_WHITELIST_ADDR_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_ADD_WHITELIST_ADDR_REQ_ID: sl_wfx_requests_ids_e = 94;
#[doc = "< \\b ADD_BLACKLIST_ADDR request ID uses body SL_WFX_ADD_BLACKLIST_ADDR_REQ_BODY and returns SL_WFX_ADD_BLACKLIST_ADDR_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_ADD_BLACKLIST_ADDR_REQ_ID: sl_wfx_requests_ids_e = 95;
#[doc = "< \\b SET_MAX_TX_POWER request ID uses body SL_WFX_SET_MAX_TX_POWER_REQ_BODY and returns SL_WFX_SET_MAX_TX_POWER_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_SET_MAX_TX_POWER_REQ_ID: sl_wfx_requests_ids_e = 96;
#[doc = "< \\b GET_MAX_TX_POWER request ID uses body SL_WFX_GET_MAX_TX_POWER_REQ_BODY and returns SL_WFX_GET_MAX_TX_POWER_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_GET_MAX_TX_POWER_REQ_ID: sl_wfx_requests_ids_e = 97;
#[doc = "< \\b GET_PMK request ID uses body SL_WFX_GET_PMK_REQ_BODY and returns SL_WFX_GET_PMK_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_GET_PMK_REQ_ID: sl_wfx_requests_ids_e = 98;
#[doc = "< \\b GET_AP_CLIENT_SIGNAL_STRENGTH request ID uses body SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_BODY and returns SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_REQ_ID: sl_wfx_requests_ids_e =
    99;
#[doc = "< \\b EXT_AUTH request ID uses body SL_WFX_EXT_AUTH_BODY and returns SL_WFX_EXT_AUTH_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_EXT_AUTH_REQ_ID: sl_wfx_requests_ids_e = 100;
#[doc = "< \\b AP_SCAN_REQUEST request ID uses body SL_WFX_AP_SCAN_REQUEST_BODY and returns SL_WFX_AP_SCAN_REQUEST_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_AP_SCAN_REQUEST_FILTER_REQ_ID: sl_wfx_requests_ids_e = 101;
#[doc = "< \\b GET_STATISTICS request ID uses body SL_WFX_GET_STATISTICS_REQ_BODY and returns SL_WFX_GET_STATISTICS_CNF_BODY"]
pub const sl_wfx_requests_ids_e_SL_WFX_GET_STATISTICS_REQ_ID: sl_wfx_requests_ids_e = 102;
#[doc = " @brief WFM API request message IDs."]
pub type sl_wfx_requests_ids_e = c_types::c_uint;
#[doc = " @brief WFM API request message IDs."]
pub use self::sl_wfx_requests_ids_e as sl_wfx_requests_ids_t;
#[doc = "< \\b SET_MAC_ADDRESS confirmation Id. Returns body SL_WFX_SET_MAC_ADDRESS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_MAC_ADDRESS_CNF_ID: sl_wfx_confirmations_ids_e = 66;
#[doc = "< \\b CONNECT confirmation Id. Returns body SL_WFX_CONNECT_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_CONNECT_CNF_ID: sl_wfx_confirmations_ids_e = 67;
#[doc = "< \\b DISCONNECT confirmation Id. Returns body SL_WFX_DISCONNECT_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_DISCONNECT_CNF_ID: sl_wfx_confirmations_ids_e = 68;
#[doc = "< \\b START_AP confirmation Id. Returns body SL_WFX_START_AP_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_START_AP_CNF_ID: sl_wfx_confirmations_ids_e = 69;
#[doc = "< \\b UPDATE_AP confirmation Id. Returns body SL_WFX_UPDATE_AP_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_UPDATE_AP_CNF_ID: sl_wfx_confirmations_ids_e = 70;
#[doc = "< \\b STOP_AP confirmation Id. Returns body SL_WFX_STOP_AP_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_STOP_AP_CNF_ID: sl_wfx_confirmations_ids_e = 71;
#[doc = "< \\b SEND_FRAME confirmation Id. Returns body SL_WFX_SEND_FRAME_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SEND_FRAME_CNF_ID: sl_wfx_confirmations_ids_e = 74;
#[doc = "< \\b START_SCAN confirmation Id. Returns body SL_WFX_START_SCAN_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_START_SCAN_CNF_ID: sl_wfx_confirmations_ids_e = 75;
#[doc = "< \\b STOP_SCAN confirmation Id. Returns body SL_WFX_STOP_SCAN_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_STOP_SCAN_CNF_ID: sl_wfx_confirmations_ids_e = 76;
#[doc = "< \\b GET_SIGNAL_STRENGTH confirmation Id. Returns body SL_WFX_GET_SIGNAL_STRENGTH_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_GET_SIGNAL_STRENGTH_CNF_ID: sl_wfx_confirmations_ids_e =
    78;
#[doc = "< \\b DISCONNECT_AP_CLIENT confirmation Id. Returns body SL_WFX_DISCONNECT_AP_CLIENT_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_DISCONNECT_AP_CLIENT_CNF_ID:
    sl_wfx_confirmations_ids_e = 79;
#[doc = "< \\b SET_PM_MODE confirmation Id. Returns body SL_WFX_SET_PM_MODE_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_PM_MODE_CNF_ID: sl_wfx_confirmations_ids_e = 82;
#[doc = "< \\b ADD_MULTICAST_ADDR confirmation Id. Returns body SL_WFX_ADD_MULTICAST_ADDR_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_ADD_MULTICAST_ADDR_CNF_ID: sl_wfx_confirmations_ids_e =
    83;
#[doc = "< \\b REMOVE_MULTICAST_ADDR confirmation Id. Returns body SL_WFX_REMOVE_MULTICAST_ADDR_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_REMOVE_MULTICAST_ADDR_CNF_ID:
    sl_wfx_confirmations_ids_e = 84;
#[doc = "< \\b SET_MAX_AP_CLIENT_COUNT confirmation Id. Returns body SL_WFX_SET_MAX_AP_CLIENT_COUNT_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_MAX_AP_CLIENT_COUNT_CNF_ID:
    sl_wfx_confirmations_ids_e = 85;
#[doc = "< \\b SET_MAX_AP_CLIENT_INACTIVITY confirmation Id. Returns body SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_CNF_ID:
    sl_wfx_confirmations_ids_e = 86;
#[doc = "< \\b SET_ROAM_PARAMETERS confirmation Id. Returns body SL_WFX_SET_ROAM_PARAMETERS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_ROAM_PARAMETERS_CNF_ID: sl_wfx_confirmations_ids_e =
    87;
#[doc = "< \\b SET_TX_RATE_PARAMETERS confirmation Id. Returns body SL_WFX_SET_TX_RATE_PARAMETERS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_TX_RATE_PARAMETERS_CNF_ID:
    sl_wfx_confirmations_ids_e = 88;
#[doc = "< \\b SET_ARP_IP_ADDRESS confirmation Id. Returns body SL_WFX_SET_ARP_IP_ADDRESS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_ARP_IP_ADDRESS_CNF_ID: sl_wfx_confirmations_ids_e =
    89;
#[doc = "< \\b SET_NS_IP_ADDRESS confirmation Id. Returns body SL_WFX_SET_NS_IP_ADDRESS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_NS_IP_ADDRESS_CNF_ID: sl_wfx_confirmations_ids_e =
    90;
#[doc = "< \\b SET_BROADCAST_FILTER confirmation Id. Returns body SL_WFX_SET_BROADCAST_FILTER_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_BROADCAST_FILTER_CNF_ID:
    sl_wfx_confirmations_ids_e = 91;
#[doc = "< \\b SET_SCAN_PARAMETERS confirmation Id. Returns body SL_WFX_SET_SCAN_PARAMETERS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_SCAN_PARAMETERS_CNF_ID: sl_wfx_confirmations_ids_e =
    92;
#[doc = "< \\b SET_UNICAST_FILTER confirmation Id. Returns body SL_WFX_SET_UNICAST_FILTER_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_UNICAST_FILTER_CNF_ID: sl_wfx_confirmations_ids_e =
    93;
#[doc = "< \\b ADD_WHITELIST_ADDR confirmation Id. Returns body SL_WFX_ADD_WHITELIST_ADDR_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_ADD_WHITELIST_ADDR_CNF_ID: sl_wfx_confirmations_ids_e =
    94;
#[doc = "< \\b ADD_BLACKLIST_ADDR confirmation Id. Returns body SL_WFX_ADD_BLACKLIST_ADDR_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_ADD_BLACKLIST_ADDR_CNF_ID: sl_wfx_confirmations_ids_e =
    95;
#[doc = "< \\b SET_MAX_TX_POWER confirmation Id. Returns body SL_WFX_SET_MAX_TX_POWER_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_SET_MAX_TX_POWER_CNF_ID: sl_wfx_confirmations_ids_e =
    96;
#[doc = "< \\b GET_MAX_TX_POWER confirmation Id. Returns body SL_WFX_GET_MAX_TX_POWER_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_GET_MAX_TX_POWER_CNF_ID: sl_wfx_confirmations_ids_e =
    97;
#[doc = "< \\b GET_PMK confirmation Id. Returns body SL_WFX_GET_PMK_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_GET_PMK_CNF_ID: sl_wfx_confirmations_ids_e = 98;
#[doc = "< \\b GET_AP_CLIENT_SIGNAL_STRENGTH confirmation Id. Returns body SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_CNF_ID:
    sl_wfx_confirmations_ids_e = 99;
#[doc = "< \\b EXT_AUTH confirmation Id. Returns body SL_WFX_EXT_AUTH_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_EXT_AUTH_CNF_ID: sl_wfx_confirmations_ids_e = 100;
#[doc = "< \\b AP_SCAN_REQUEST confirmation Id. Returns body SL_WFX_AP_SCAN_REQUEST_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_AP_SCAN_REQUEST_FILTER_CNF_ID:
    sl_wfx_confirmations_ids_e = 101;
#[doc = "< \\b GET_STATISTICS confirmation Id. Returns body SL_WFX_GET_STATISTICS_CNF_BODY"]
pub const sl_wfx_confirmations_ids_e_SL_WFX_GET_STATISTICS_CNF_ID: sl_wfx_confirmations_ids_e = 102;
#[doc = " @brief WFM API confirmation message IDs."]
pub type sl_wfx_confirmations_ids_e = c_types::c_uint;
#[doc = " @brief WFM API confirmation message IDs."]
pub use self::sl_wfx_confirmations_ids_e as sl_wfx_confirmations_ids_t;
#[doc = "< \\b CONNECT indication id. Content is SL_WFX_CONNECT_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_CONNECT_IND_ID: sl_wfx_indications_ids_e = 195;
#[doc = "< \\b DISCONNECT indication id. Content is SL_WFX_DISCONNECT_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_DISCONNECT_IND_ID: sl_wfx_indications_ids_e = 196;
#[doc = "< \\b START_AP indication id. Content is SL_WFX_START_AP_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_START_AP_IND_ID: sl_wfx_indications_ids_e = 197;
#[doc = "< \\b STOP_AP indication id. Content is SL_WFX_STOP_AP_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_STOP_AP_IND_ID: sl_wfx_indications_ids_e = 199;
#[doc = "< \\b RECEIVED indication id. Content is SL_WFX_RECEIVED_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_RECEIVED_IND_ID: sl_wfx_indications_ids_e = 202;
#[doc = "< \\b SCAN_RESULT indication id. Content is SL_WFX_SCAN_RESULT_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_SCAN_RESULT_IND_ID: sl_wfx_indications_ids_e = 203;
#[doc = "< \\b SCAN_COMPLETE indication id. Content is SL_WFX_SCAN_COMPLETE_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_SCAN_COMPLETE_IND_ID: sl_wfx_indications_ids_e = 204;
#[doc = "< \\b AP_CLIENT_CONNECTED indication id. Content is SL_WFX_AP_CLIENT_CONNECTED_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_AP_CLIENT_CONNECTED_IND_ID: sl_wfx_indications_ids_e =
    205;
#[doc = "< \\b AP_CLIENT_REJECTED indication id. Content is SL_WFX_AP_CLIENT_REJECTED_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_AP_CLIENT_REJECTED_IND_ID: sl_wfx_indications_ids_e = 206;
#[doc = "< \\b AP_CLIENT_DISCONNECTED indication id. Content is SL_WFX_AP_CLIENT_DISCONNECTED_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_AP_CLIENT_DISCONNECTED_IND_ID: sl_wfx_indications_ids_e =
    207;
#[doc = "< \\b EXT_AUTH indication Id. Content is SL_WFX_EXT_AUTH_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_EXT_AUTH_IND_ID: sl_wfx_indications_ids_e = 210;
#[doc = "< \\b PS_MODE_ERROR indication Id. Content is SL_WFX_PS_MODE_ERROR_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_PS_MODE_ERROR_IND_ID: sl_wfx_indications_ids_e = 211;
#[doc = "< \\b AP_SCAN_REQUEST indication Id. Content is SL_WFX_AP_SCAN_REQUEST_IND_BODY"]
pub const sl_wfx_indications_ids_e_SL_WFX_AP_SCAN_REQUEST_IND_ID: sl_wfx_indications_ids_e = 212;
#[doc = " @brief WFM API indication message IDs."]
pub type sl_wfx_indications_ids_e = c_types::c_uint;
#[doc = " @brief WFM API indication message IDs."]
pub use self::sl_wfx_indications_ids_e as sl_wfx_indications_ids_t;
#[doc = " @brief WFM API message IDs."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union wfm_message_ids_u {
    #[doc = " Request messages sent from the host to the device."]
    pub requests: sl_wfx_requests_ids_t,
    #[doc = " Confirmation messages sent from the device to the host."]
    pub confirmations: sl_wfx_confirmations_ids_t,
    #[doc = " Indication messages sent from the device to the host."]
    pub indications: sl_wfx_indications_ids_t,
}
#[test]
fn bindgen_test_layout_wfm_message_ids_u() {
    const UNINIT: ::core::mem::MaybeUninit<wfm_message_ids_u> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<wfm_message_ids_u>(),
        4usize,
        concat!("Size of: ", stringify!(wfm_message_ids_u))
    );
    assert_eq!(
        ::core::mem::align_of::<wfm_message_ids_u>(),
        1usize,
        concat!("Alignment of ", stringify!(wfm_message_ids_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).requests) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wfm_message_ids_u),
            "::",
            stringify!(requests)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).confirmations) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wfm_message_ids_u),
            "::",
            stringify!(confirmations)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).indications) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wfm_message_ids_u),
            "::",
            stringify!(indications)
        )
    );
}
#[doc = " @brief WFM API message IDs."]
pub type sl_wfx_message_ids_t = wfm_message_ids_u;
#[doc = "< Client isolation disabled"]
pub const sl_wfx_client_isolation_e_WFM_CLIENT_ISOLATION_DISABLED: sl_wfx_client_isolation_e = 0;
#[doc = "< Client isolation enabled"]
pub const sl_wfx_client_isolation_e_WFM_CLIENT_ISOLATION_ENABLED: sl_wfx_client_isolation_e = 1;
#[doc = " @brief Client Isolation toggling."]
pub type sl_wfx_client_isolation_e = c_types::c_uint;
#[doc = " @brief Client Isolation toggling."]
pub use self::sl_wfx_client_isolation_e as sl_wfx_client_isolation_t;
#[doc = "< Management Frame"]
pub const sl_wfx_frame_type_e_WFM_FRAME_TYPE_MGMT: sl_wfx_frame_type_e = 0;
#[doc = "< Action Frame"]
pub const sl_wfx_frame_type_e_WFM_FRAME_TYPE_ACTION: sl_wfx_frame_type_e = 4;
#[doc = "< Data Frame"]
pub const sl_wfx_frame_type_e_WFM_FRAME_TYPE_DATA: sl_wfx_frame_type_e = 8;
#[doc = " @brief Type of frame to be sent.\n\n Value unused, all frames are considered to be Data by default.@n\n Support for the other types will be added later."]
pub type sl_wfx_frame_type_e = c_types::c_uint;
#[doc = " @brief Type of frame to be sent.\n\n Value unused, all frames are considered to be Data by default.@n\n Support for the other types will be added later."]
pub use self::sl_wfx_frame_type_e as sl_wfx_frame_type_t;
#[doc = "< SSID not hidden"]
pub const sl_wfx_hidden_ssid_e_WFM_HIDDEN_SSID_FALSE: sl_wfx_hidden_ssid_e = 0;
#[doc = "< SSID hidden"]
pub const sl_wfx_hidden_ssid_e_WFM_HIDDEN_SSID_TRUE: sl_wfx_hidden_ssid_e = 1;
#[doc = " @brief Hidden SSID toggling."]
pub type sl_wfx_hidden_ssid_e = c_types::c_uint;
#[doc = " @brief Hidden SSID toggling."]
pub use self::sl_wfx_hidden_ssid_e as sl_wfx_hidden_ssid_t;
#[doc = "< PMF disabled"]
pub const sl_wfx_mgmt_frame_protection_e_WFM_MGMT_FRAME_PROTECTION_DISABLED:
    sl_wfx_mgmt_frame_protection_e = 0;
#[doc = "< PMF optional"]
pub const sl_wfx_mgmt_frame_protection_e_WFM_MGMT_FRAME_PROTECTION_OPTIONAL:
    sl_wfx_mgmt_frame_protection_e = 1;
#[doc = "< PMF mandatory"]
pub const sl_wfx_mgmt_frame_protection_e_WFM_MGMT_FRAME_PROTECTION_MANDATORY:
    sl_wfx_mgmt_frame_protection_e = 2;
#[doc = " @brief Device Protected Management Frame mode."]
pub type sl_wfx_mgmt_frame_protection_e = c_types::c_uint;
#[doc = " @brief Device Protected Management Frame mode."]
pub use self::sl_wfx_mgmt_frame_protection_e as sl_wfx_mgmt_frame_protection_t;
#[doc = "< Always on"]
pub const sl_wfx_pm_mode_e_WFM_PM_MODE_ACTIVE: sl_wfx_pm_mode_e = 0;
#[doc = "< Use power_save and wake up on beacons"]
pub const sl_wfx_pm_mode_e_WFM_PM_MODE_PS: sl_wfx_pm_mode_e = 1;
#[doc = "< Use power_save and wake up on DTIM"]
pub const sl_wfx_pm_mode_e_WFM_PM_MODE_DTIM: sl_wfx_pm_mode_e = 2;
#[doc = " @brief Device power management mode."]
pub type sl_wfx_pm_mode_e = c_types::c_uint;
#[doc = " @brief Device power management mode."]
pub use self::sl_wfx_pm_mode_e as sl_wfx_pm_mode_t;
#[doc = "< Use U-APSD"]
pub const sl_wfx_pm_poll_e_WFM_PM_POLL_UAPSD: sl_wfx_pm_poll_e = 0;
#[doc = "< Use Fast PS"]
pub const sl_wfx_pm_poll_e_WFM_PM_POLL_FAST_PS: sl_wfx_pm_poll_e = 1;
#[doc = " @brief Device power save polling strategy."]
pub type sl_wfx_pm_poll_e = c_types::c_uint;
#[doc = " @brief Device power save polling strategy."]
pub use self::sl_wfx_pm_poll_e as sl_wfx_pm_poll_t;
#[doc = "< Best Effort"]
pub const sl_wfx_priority_e_WFM_PRIORITY_BE0: sl_wfx_priority_e = 0;
#[doc = "< Background"]
pub const sl_wfx_priority_e_WFM_PRIORITY_BK1: sl_wfx_priority_e = 1;
#[doc = "< Background"]
pub const sl_wfx_priority_e_WFM_PRIORITY_BK2: sl_wfx_priority_e = 2;
#[doc = "< Best Effort"]
pub const sl_wfx_priority_e_WFM_PRIORITY_BE3: sl_wfx_priority_e = 3;
#[doc = "< Video"]
pub const sl_wfx_priority_e_WFM_PRIORITY_VI4: sl_wfx_priority_e = 4;
#[doc = "< Video"]
pub const sl_wfx_priority_e_WFM_PRIORITY_VI5: sl_wfx_priority_e = 5;
#[doc = "< Voice"]
pub const sl_wfx_priority_e_WFM_PRIORITY_VO6: sl_wfx_priority_e = 6;
#[doc = "< Voice"]
pub const sl_wfx_priority_e_WFM_PRIORITY_VO7: sl_wfx_priority_e = 7;
#[doc = " @brief Data priority level per 802.1D."]
pub type sl_wfx_priority_e = c_types::c_uint;
#[doc = " @brief Data priority level per 802.1D."]
pub use self::sl_wfx_priority_e as sl_wfx_priority_t;
#[doc = "< Unspecified reason (unused)"]
pub const sl_wfx_reason_e_WFM_REASON_UNSPECIFIED: sl_wfx_reason_e = 0;
#[doc = "< Client timed out"]
pub const sl_wfx_reason_e_WFM_REASON_TIMEOUT: sl_wfx_reason_e = 1;
#[doc = "< Client left"]
pub const sl_wfx_reason_e_WFM_REASON_LEAVING_BSS: sl_wfx_reason_e = 2;
#[doc = "< Client not authenticated"]
pub const sl_wfx_reason_e_WFM_REASON_UNKNOWN_STA: sl_wfx_reason_e = 3;
#[doc = "< Too many clients already connected"]
pub const sl_wfx_reason_e_WFM_REASON_AP_FULL: sl_wfx_reason_e = 4;
#[doc = "< WPA authentication failed"]
pub const sl_wfx_reason_e_WFM_REASON_AUTHENTICATION_FAILURE: sl_wfx_reason_e = 5;
#[doc = " @brief Reasons for AP to reject or disconnect a client."]
pub type sl_wfx_reason_e = c_types::c_uint;
#[doc = " @brief Reasons for AP to reject or disconnect a client."]
pub use self::sl_wfx_reason_e as sl_wfx_reason_t;
#[doc = "< Unspecified reason"]
pub const sl_wfx_disconnected_reason_e_WFM_DISCONNECTED_REASON_UNSPECIFIED:
    sl_wfx_disconnected_reason_e = 0;
#[doc = "< AP timed out"]
pub const sl_wfx_disconnected_reason_e_WFM_DISCONNECTED_REASON_AP_LOST:
    sl_wfx_disconnected_reason_e = 1;
#[doc = "< Disconnected by AP"]
pub const sl_wfx_disconnected_reason_e_WFM_DISCONNECTED_REASON_REJECTED:
    sl_wfx_disconnected_reason_e = 2;
#[doc = "< Leaving intentionally"]
pub const sl_wfx_disconnected_reason_e_WFM_DISCONNECTED_REASON_LEAVING_BSS:
    sl_wfx_disconnected_reason_e = 3;
#[doc = "< WPA countermeasures triggered a disconnection"]
pub const sl_wfx_disconnected_reason_e_WFM_DISCONNECTED_REASON_WPA_COUNTERMEASURES:
    sl_wfx_disconnected_reason_e = 4;
#[doc = " @brief Reasons for STA disconnection"]
pub type sl_wfx_disconnected_reason_e = c_types::c_uint;
#[doc = " @brief Reasons for STA disconnection"]
pub use self::sl_wfx_disconnected_reason_e as sl_wfx_disconnected_reason_t;
#[doc = "< Passive scan: listen for beacons only"]
pub const sl_wfx_scan_mode_e_WFM_SCAN_MODE_PASSIVE: sl_wfx_scan_mode_e = 0;
#[doc = "< Active scan: send probe requests"]
pub const sl_wfx_scan_mode_e_WFM_SCAN_MODE_ACTIVE: sl_wfx_scan_mode_e = 1;
#[doc = " @brief Scan mode to be used."]
pub type sl_wfx_scan_mode_e = c_types::c_uint;
#[doc = " @brief Scan mode to be used."]
pub use self::sl_wfx_scan_mode_e as sl_wfx_scan_mode_t;
#[doc = "< No security"]
pub const sl_wfx_security_mode_e_WFM_SECURITY_MODE_OPEN: sl_wfx_security_mode_e = 0;
#[doc = "< Use WEP"]
pub const sl_wfx_security_mode_e_WFM_SECURITY_MODE_WEP: sl_wfx_security_mode_e = 1;
#[doc = "< Use WPA1 or WPA2"]
pub const sl_wfx_security_mode_e_WFM_SECURITY_MODE_WPA2_WPA1_PSK: sl_wfx_security_mode_e = 2;
#[doc = "< Use only WPA2"]
pub const sl_wfx_security_mode_e_WFM_SECURITY_MODE_WPA2_PSK: sl_wfx_security_mode_e = 4;
#[doc = "< Use WPA3 (STA mode only)"]
pub const sl_wfx_security_mode_e_WFM_SECURITY_MODE_WPA3_SAE: sl_wfx_security_mode_e = 6;
#[doc = " @brief Security mode of a network."]
pub type sl_wfx_security_mode_e = c_types::c_uint;
#[doc = " @brief Security mode of a network."]
pub use self::sl_wfx_security_mode_e as sl_wfx_security_mode_t;
#[doc = "<"]
pub const sl_wfx_ext_auth_data_type_e_WFM_EXT_AUTH_DATA_TYPE_SAE_START:
    sl_wfx_ext_auth_data_type_e = 0;
#[doc = "<"]
pub const sl_wfx_ext_auth_data_type_e_WFM_EXT_AUTH_DATA_TYPE_SAE_COMMIT:
    sl_wfx_ext_auth_data_type_e = 1;
#[doc = "<"]
pub const sl_wfx_ext_auth_data_type_e_WFM_EXT_AUTH_DATA_TYPE_SAE_CONFIRM:
    sl_wfx_ext_auth_data_type_e = 2;
#[doc = "<"]
pub const sl_wfx_ext_auth_data_type_e_WFM_EXT_AUTH_DATA_TYPE_MSK: sl_wfx_ext_auth_data_type_e = 3;
#[doc = " @brief Type of the authentication message."]
pub type sl_wfx_ext_auth_data_type_e = c_types::c_uint;
#[doc = " @brief Type of the authentication message."]
pub use self::sl_wfx_ext_auth_data_type_e as sl_wfx_ext_auth_data_type_t;
#[doc = "< The device has successfully completed a request."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_SUCCESS: sl_wfx_fmac_status_e = 0;
#[doc = "< A request contains one or more invalid parameters."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_INVALID_PARAMETER: sl_wfx_fmac_status_e = 1;
#[doc = "< The request cannot be performed because the device is in an inappropriate state."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_WRONG_STATE: sl_wfx_fmac_status_e = 2;
#[doc = "< The request failed due to an error."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_GENERAL_FAILURE: sl_wfx_fmac_status_e = 3;
#[doc = "< The request failed due to regulatory limitations."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_CHANNEL_NOT_ALLOWED: sl_wfx_fmac_status_e = 4;
#[doc = "< The request is successful but some parameters have been ignored."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_WARNING: sl_wfx_fmac_status_e = 5;
#[doc = "< The request failed because no suitable AP was found for the connection"]
pub const sl_wfx_fmac_status_e_WFM_STATUS_NO_MATCHING_AP: sl_wfx_fmac_status_e = 6;
#[doc = "< The request failed because the user issued a WFM_HI_DISCONNECT_REQ before completing the connection"]
pub const sl_wfx_fmac_status_e_WFM_STATUS_CONNECTION_ABORTED: sl_wfx_fmac_status_e = 7;
#[doc = "< The request failed because a timeout occurred during connection"]
pub const sl_wfx_fmac_status_e_WFM_STATUS_CONNECTION_TIMEOUT: sl_wfx_fmac_status_e = 8;
#[doc = "< The request failed because the AP rejected the connection"]
pub const sl_wfx_fmac_status_e_WFM_STATUS_CONNECTION_REJECTED_BY_AP: sl_wfx_fmac_status_e = 9;
#[doc = "< The request failed because the WPA handshake did not complete successfully"]
pub const sl_wfx_fmac_status_e_WFM_STATUS_CONNECTION_AUTH_FAILURE: sl_wfx_fmac_status_e = 10;
#[doc = "< The request failed because the retry limit was exceeded."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_RETRY_EXCEEDED: sl_wfx_fmac_status_e = 19;
#[doc = "< The request failed because the MSDU life time was exceeded."]
pub const sl_wfx_fmac_status_e_WFM_STATUS_TX_LIFETIME_EXCEEDED: sl_wfx_fmac_status_e = 20;
#[doc = "< The request failed because TX is suspended (temperature too high)"]
pub const sl_wfx_fmac_status_e_WFM_STATUS_REQUEUE: sl_wfx_fmac_status_e = 21;
#[doc = " @brief Full MAC (UMAC) confirmation possible values for a returned 'status' field.\n\n All Full MAC (UMAC) confirmation messages have a field 'status' just after the message header.@n\n A value of zero indicates the request has completed successfully."]
pub type sl_wfx_fmac_status_e = c_types::c_uint;
#[doc = " @brief Full MAC (UMAC) confirmation possible values for a returned 'status' field.\n\n All Full MAC (UMAC) confirmation messages have a field 'status' just after the message header.@n\n A value of zero indicates the request has completed successfully."]
pub use self::sl_wfx_fmac_status_e as sl_wfx_fmac_status_t;
#[doc = " @brief Service Set Identifier (SSID) of a network.\n @details Note that the Ssid element must always contain SL_WFX_SSID_SIZE bytes.\n          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_ssid_def_s {
    #[doc = " @brief Length of SSID data.\n @details <B>0 - 32</B>: The amount of bytes."]
    pub ssid_length: u32,
    #[doc = " SSID data."]
    pub ssid: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_ssid_def_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_ssid_def_s> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_ssid_def_s>(),
        36usize,
        concat!("Size of: ", stringify!(sl_wfx_ssid_def_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_ssid_def_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_ssid_def_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ssid_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ssid_def_s),
            "::",
            stringify!(ssid_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ssid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ssid_def_s),
            "::",
            stringify!(ssid)
        )
    );
}
#[doc = " @brief Service Set Identifier (SSID) of a network.\n @details Note that the Ssid element must always contain SL_WFX_SSID_SIZE bytes.\n          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero."]
pub type sl_wfx_ssid_def_t = sl_wfx_ssid_def_s;
#[doc = " @brief Security mode bitmask for scan results. Empty if Open network."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_security_mode_bitmask_s {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_sl_wfx_security_mode_bitmask_s() {
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_security_mode_bitmask_s>(),
        1usize,
        concat!("Size of: ", stringify!(sl_wfx_security_mode_bitmask_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_security_mode_bitmask_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_security_mode_bitmask_s))
    );
}
impl sl_wfx_security_mode_bitmask_s {
    #[inline]
    pub fn wep(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_wep(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wpa(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_wpa(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wpa2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_wpa2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wpa3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_wpa3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pmf(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pmf(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unused(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn psk(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_psk(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn eap(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_eap(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        wep: u8,
        wpa: u8,
        wpa2: u8,
        wpa3: u8,
        pmf: u8,
        unused: u8,
        psk: u8,
        eap: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let wep: u8 = unsafe { ::core::mem::transmute(wep) };
            wep as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let wpa: u8 = unsafe { ::core::mem::transmute(wpa) };
            wpa as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let wpa2: u8 = unsafe { ::core::mem::transmute(wpa2) };
            wpa2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let wpa3: u8 = unsafe { ::core::mem::transmute(wpa3) };
            wpa3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let pmf: u8 = unsafe { ::core::mem::transmute(pmf) };
            pmf as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let unused: u8 = unsafe { ::core::mem::transmute(unused) };
            unused as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let psk: u8 = unsafe { ::core::mem::transmute(psk) };
            psk as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let eap: u8 = unsafe { ::core::mem::transmute(eap) };
            eap as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief Security mode bitmask for scan results. Empty if Open network."]
pub type sl_wfx_security_mode_bitmask_t = sl_wfx_security_mode_bitmask_s;
#[doc = " @brief Device TX rate set bitmask used in sl_wfx_set_tx_rate_parameters_req_body_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_rate_set_bitmask_s {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    #[doc = "< Reserved, set to zero"]
    pub unused2: u8,
}
#[test]
fn bindgen_test_layout_sl_wfx_rate_set_bitmask_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_rate_set_bitmask_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_rate_set_bitmask_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_rate_set_bitmask_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_rate_set_bitmask_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_rate_set_bitmask_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unused2) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_rate_set_bitmask_s),
            "::",
            stringify!(unused2)
        )
    );
}
impl sl_wfx_rate_set_bitmask_s {
    #[inline]
    pub fn b1Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_b1Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn b2Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_b2Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn b5P5Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_b5P5Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn b11Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_b11Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unused(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_unused(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn g6Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g6Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g9Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g9Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g12Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g12Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g18Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g18Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g24Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g24Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g36Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g36Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g48Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g48Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn g54Mbps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_g54Mbps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mcs7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mcs7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        b1Mbps: u8,
        b2Mbps: u8,
        b5P5Mbps: u8,
        b11Mbps: u8,
        unused: u8,
        g6Mbps: u8,
        g9Mbps: u8,
        g12Mbps: u8,
        g18Mbps: u8,
        g24Mbps: u8,
        g36Mbps: u8,
        g48Mbps: u8,
        g54Mbps: u8,
        mcs0: u8,
        mcs1: u8,
        mcs2: u8,
        mcs3: u8,
        mcs4: u8,
        mcs5: u8,
        mcs6: u8,
        mcs7: u8,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let b1Mbps: u8 = unsafe { ::core::mem::transmute(b1Mbps) };
            b1Mbps as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let b2Mbps: u8 = unsafe { ::core::mem::transmute(b2Mbps) };
            b2Mbps as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let b5P5Mbps: u8 = unsafe { ::core::mem::transmute(b5P5Mbps) };
            b5P5Mbps as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let b11Mbps: u8 = unsafe { ::core::mem::transmute(b11Mbps) };
            b11Mbps as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let unused: u8 = unsafe { ::core::mem::transmute(unused) };
            unused as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let g6Mbps: u8 = unsafe { ::core::mem::transmute(g6Mbps) };
            g6Mbps as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let g9Mbps: u8 = unsafe { ::core::mem::transmute(g9Mbps) };
            g9Mbps as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let g12Mbps: u8 = unsafe { ::core::mem::transmute(g12Mbps) };
            g12Mbps as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let g18Mbps: u8 = unsafe { ::core::mem::transmute(g18Mbps) };
            g18Mbps as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let g24Mbps: u8 = unsafe { ::core::mem::transmute(g24Mbps) };
            g24Mbps as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let g36Mbps: u8 = unsafe { ::core::mem::transmute(g36Mbps) };
            g36Mbps as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let g48Mbps: u8 = unsafe { ::core::mem::transmute(g48Mbps) };
            g48Mbps as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let g54Mbps: u8 = unsafe { ::core::mem::transmute(g54Mbps) };
            g54Mbps as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let mcs0: u8 = unsafe { ::core::mem::transmute(mcs0) };
            mcs0 as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let mcs1: u8 = unsafe { ::core::mem::transmute(mcs1) };
            mcs1 as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let mcs2: u8 = unsafe { ::core::mem::transmute(mcs2) };
            mcs2 as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let mcs3: u8 = unsafe { ::core::mem::transmute(mcs3) };
            mcs3 as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let mcs4: u8 = unsafe { ::core::mem::transmute(mcs4) };
            mcs4 as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let mcs5: u8 = unsafe { ::core::mem::transmute(mcs5) };
            mcs5 as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let mcs6: u8 = unsafe { ::core::mem::transmute(mcs6) };
            mcs6 as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let mcs7: u8 = unsafe { ::core::mem::transmute(mcs7) };
            mcs7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief Device TX rate set bitmask used in sl_wfx_set_tx_rate_parameters_req_body_t."]
pub type sl_wfx_rate_set_bitmask_t = sl_wfx_rate_set_bitmask_s;
#[doc = " @brief NS IP address element.\n @details Note that the IP element must always contain SL_WFX_IPV6_ADDR_SIZE bytes.\n          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_ns_ip_addr_s {
    #[doc = " NS IP address."]
    pub ipv6_addr: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_ns_ip_addr_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_ns_ip_addr_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_ns_ip_addr_s>(),
        16usize,
        concat!("Size of: ", stringify!(sl_wfx_ns_ip_addr_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_ns_ip_addr_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_ns_ip_addr_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ipv6_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ns_ip_addr_s),
            "::",
            stringify!(ipv6_addr)
        )
    );
}
#[doc = " @brief NS IP address element.\n @details Note that the IP element must always contain SL_WFX_IPV6_ADDR_SIZE bytes.\n          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero."]
pub type sl_wfx_ns_ip_addr_t = sl_wfx_ns_ip_addr_s;
#[doc = " @brief Request message body for sl_wfx_set_mac_address_req_t.\n @details\n          | Field       | Default value    | Reset to default value |\n          |:------------|:-----------------|:-----------------------|\n          | MAC address | device dependent | when device reset      |\n          <BR>"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_mac_address_req_body_s {
    #[doc = " MAC address of the interface."]
    pub mac_addr: [u8; 6usize],
    #[doc = " Reserved, set to zero."]
    pub reserved: u16,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_mac_address_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_mac_address_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_mac_address_req_body_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_mac_address_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_mac_address_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_mac_address_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_req_body_s),
            "::",
            stringify!(mac_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_req_body_s),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " @brief Request message body for sl_wfx_set_mac_address_req_t.\n @details\n          | Field       | Default value    | Reset to default value |\n          |:------------|:-----------------|:-----------------------|\n          | MAC address | device dependent | when device reset      |\n          <BR>"]
pub type sl_wfx_set_mac_address_req_body_t = sl_wfx_set_mac_address_req_body_s;
#[doc = " @brief Request message to set MAC address of the interface.\n @details The host can use this request to set the MAC address of an interface.\n          If not set, the device will use a built-in MAC address. Note that\n          if multiple interfaces are used, the MAC address MUST be different\n          on each interface.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | Yes             |\n          | station        | No              |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_mac_address_req_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Request message body."]
    pub body: sl_wfx_set_mac_address_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_mac_address_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_mac_address_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_mac_address_req_s>(),
        12usize,
        concat!("Size of: ", stringify!(sl_wfx_set_mac_address_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_mac_address_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_mac_address_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_req_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Request message to set MAC address of the interface.\n @details The host can use this request to set the MAC address of an interface.\n          If not set, the device will use a built-in MAC address. Note that\n          if multiple interfaces are used, the MAC address MUST be different\n          on each interface.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | Yes             |\n          | station        | No              |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_set_mac_address_req_t = sl_wfx_set_mac_address_req_s;
#[doc = " @brief Confirmation message body for sl_wfx_set_mac_address_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_mac_address_cnf_body_s {
    #[doc = " @brief Status of the set request.\n @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.\n          <BR><B>any other value</B>: the set request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_mac_address_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_mac_address_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_mac_address_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_set_mac_address_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_mac_address_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_set_mac_address_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_set_mac_address_cnf_t."]
pub type sl_wfx_set_mac_address_cnf_body_t = sl_wfx_set_mac_address_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_set_mac_address_req_t.\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_mac_address_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_set_mac_address_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_mac_address_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_mac_address_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_mac_address_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_mac_address_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_mac_address_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_mac_address_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_mac_address_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_set_mac_address_req_t.\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_set_mac_address_cnf_t = sl_wfx_set_mac_address_cnf_s;
#[doc = " @brief Request message body for sl_wfx_connect_req_t."]
#[repr(C, packed)]
pub struct sl_wfx_connect_req_body_s {
    #[doc = " @brief Service Set Identifier (SSID) of the network."]
    pub ssid_def: sl_wfx_ssid_def_t,
    #[doc = " @brief Basic Service Set Identifier (BSSID) of the Access Point.\n @details <B>broadcast address</B>: The device will connect to any matching access point.\n          <BR><B>unicast address</B>: The device will only connect to the given Access Point.\n          <BR>See @ref WFM_CONCEPT_BSSID for further details."]
    pub bssid: [u8; 6usize],
    #[doc = " @brief Channel of the Access Point.\n @details <B>0</B>: The device will connect to a matching Access Point on any channel.\n          <BR><B>1 - 13</B>: The device will only connect to a matching Access Point on the given channel."]
    pub channel: u16,
    #[doc = " @brief Security mode of the network.\n @details <B>WFM_SECURITY_MODE_OPEN</B>: The device will only connect to an unsecured Access Point.\n          <BR><B>WFM_SECURITY_MODE_WEP</B>: The device will only connect to a WEP Access Point.\n          <BR><B>WFM_SECURITY_MODE_WPA2_WPA1_PSK</B>: The device will only connect to a WPA-Personal or a WPA2-Personal Access Point.\n          <BR><B>WFM_SECURITY_MODE_WPA2_PSK</B>: The device will only connect to a WPA2-Personal access point.\n          <BR><B>WFM_SECURITY_MODE_WPA3_SAE</B>: The device will only connect to a WPA3-SAE access point.\n          <BR>See wfm_security_mode for enumeration values."]
    pub security_mode: u8,
    #[doc = " @brief Boolean option to prevent roaming between access points.\n @details <B>0</B>: The device may roam to any matching access point within the same network.\n          <BR><B>1</B>: The device will not roam to any other access point."]
    pub prevent_roaming: u8,
    #[doc = " @brief Protected Management Frames (PMF) mode.\n @details <B>WFM_MGMT_FRAME_PROTECTION_DISABLED</B>: The device will not use PMF even if supported by the access point.\n          <BR><B>WFM_MGMT_FRAME_PROTECTION_OPTIONAL</B>: The device will use PMF if supported by the access point.\n          <BR><B>WFM_MGMT_FRAME_PROTECTION_MANDATORY</B>: The device will only connect to an access point supporting PMF.\n          <BR>See wfm_mgmt_frame_protection for enumeration values."]
    pub mgmt_frame_protection: u16,
    #[doc = " @brief Length of the network password.\n @details <B>0 - 64</B>: The amount of bytes."]
    pub password_length: u16,
    #[doc = " @brief Password of the network.\n @details <B>64-bit WEP key</B>: 5 bytes in ASCII format or 10 bytes in HEX format.\n          <BR><B>128-bit WEP key</B>: 13 bytes in ASCII format or 26 bytes in HEX format.\n          <BR><B>WPA pass phrase</B>: 8 - 63 bytes in ASCII format.\n          <BR><B>WPA PMK</B>: 64 bytes in HEX format.\n          <BR>See @ref WFM_CONCEPT_PASSWORD for further details."]
    pub password: [u8; 64usize],
    #[doc = " @brief Length of vendor-specific Information Element (IE) data.\n @details <B>0 - 255</B>: The amount of bytes."]
    pub ie_data_length: u16,
    #[doc = " @brief Vendor-specific IE data added to the 802.11 Association Request frames.\n @details The IE data must be in 802.11 Vendor-Specific Element format.\n          It may contain multiple concatenated IEs, up to the maximum length.\n          <BR>See @ref WFM_CONCEPT_VENDOR_IE for further details."]
    pub ie_data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_connect_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_connect_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_connect_req_body_s>(),
        116usize,
        concat!("Size of: ", stringify!(sl_wfx_connect_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_connect_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_connect_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ssid_def) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(ssid_def)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bssid) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(bssid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security_mode) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(security_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prevent_roaming) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(prevent_roaming)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mgmt_frame_protection) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(mgmt_frame_protection)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).password_length) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(password_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).password) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_data_length) as usize - ptr as usize },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(ie_data_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_data) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_body_s),
            "::",
            stringify!(ie_data)
        )
    );
}
#[doc = " @brief Request message body for sl_wfx_connect_req_t."]
pub type sl_wfx_connect_req_body_t = sl_wfx_connect_req_body_s;
#[doc = " @brief Request message for connecting to a Wi-Fi network.\n @details The host can use this request to initiate a connection to a Wi-Fi network.\n          An ongoing connection attempt can be canceled by sending sl_wfx_disconnect_req_t\n          message. Completion of the connection request will be signaled by sl_wfx_connect_ind_t\n          message. It may take up to 10 seconds to receive the message.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | Yes             |\n          | station        | No              |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
pub struct sl_wfx_connect_req_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Request message body."]
    pub body: sl_wfx_connect_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_connect_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_connect_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_connect_req_s>(),
        120usize,
        concat!("Size of: ", stringify!(sl_wfx_connect_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_connect_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_connect_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_req_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Request message for connecting to a Wi-Fi network.\n @details The host can use this request to initiate a connection to a Wi-Fi network.\n          An ongoing connection attempt can be canceled by sending sl_wfx_disconnect_req_t\n          message. Completion of the connection request will be signaled by sl_wfx_connect_ind_t\n          message. It may take up to 10 seconds to receive the message.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | Yes             |\n          | station        | No              |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_connect_req_t = sl_wfx_connect_req_s;
#[doc = " @brief Confirmation message body for sl_wfx_connect_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_connect_cnf_body_s {
    #[doc = " @brief Status of the connection request.\n @details <B>WFM_STATUS_SUCCESS</B>: the connection request was accepted. It will be completed by sl_wfx_connect_ind_t.\n          <BR><B>any other value</B>: the connection request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_connect_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_connect_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_connect_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_connect_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_connect_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_connect_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_connect_cnf_t."]
pub type sl_wfx_connect_cnf_body_t = sl_wfx_connect_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_connect_req_t.\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_connect_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_connect_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_connect_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_connect_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_connect_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_connect_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_connect_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_connect_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_connect_req_t.\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_connect_cnf_t = sl_wfx_connect_cnf_s;
#[doc = " @brief Indication message body for sl_wfx_connect_ind_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_connect_ind_body_s {
    #[doc = " @brief Status of the connection request.\n @details <B>WFM_STATUS_SUCCESS</B>: the connection request was completed successfully.\n          <BR><B>any other value</B>: the connection request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
    #[doc = " @brief MAC address of the connected access point."]
    pub mac: [u8; 6usize],
    #[doc = " @brief Channel of the connected access point.\n @details <B>1 - 13</B>: Channel number."]
    pub channel: u16,
    #[doc = " @brief Beacon Interval of the connected access point."]
    pub beacon_interval: u8,
    #[doc = " @brief DTIM period of the connected access point.\n @details <B>1 - 255</B>: DTIM period."]
    pub dtim_period: u8,
    #[doc = " @brief Maximum PHY data rate supported by the connection.\n @details See sl_wfx_rate_index_t for enumeration values."]
    pub max_phy_rate: u16,
}
#[test]
fn bindgen_test_layout_sl_wfx_connect_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_connect_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_connect_ind_body_s>(),
        16usize,
        concat!("Size of: ", stringify!(sl_wfx_connect_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_connect_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_connect_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_body_s),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_body_s),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_body_s),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).beacon_interval) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_body_s),
            "::",
            stringify!(beacon_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dtim_period) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_body_s),
            "::",
            stringify!(dtim_period)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_phy_rate) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_body_s),
            "::",
            stringify!(max_phy_rate)
        )
    );
}
#[doc = " @brief Indication message body for sl_wfx_connect_ind_t."]
pub type sl_wfx_connect_ind_body_t = sl_wfx_connect_ind_body_s;
#[doc = " @brief Indication message used to signal the completion of a connection operation.\n @details The device will send this indication to signal the connection request initiated\n          with sl_wfx_connect_req_t has been completed. The indication is also sent when\n          the device autonomously roams to another access point.\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_connect_ind_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Indication message body."]
    pub body: sl_wfx_connect_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_connect_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_connect_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_connect_ind_s>(),
        20usize,
        concat!("Size of: ", stringify!(sl_wfx_connect_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_connect_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_connect_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_connect_ind_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Indication message used to signal the completion of a connection operation.\n @details The device will send this indication to signal the connection request initiated\n          with sl_wfx_connect_req_t has been completed. The indication is also sent when\n          the device autonomously roams to another access point.\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_connect_ind_t = sl_wfx_connect_ind_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_disconnect_req_t = sl_wfx_header_t;
#[doc = " @brief Confirmation message body for sl_wfx_disconnect_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_cnf_body_s {
    #[doc = " @brief Status of the disconnection request.\n @details <B>WFM_STATUS_SUCCESS</B>: the disconnection request was accepted. It will be completed by sl_wfx_disconnect_ind_t.\n          <BR><B>any other value</B>: the disconnection request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_disconnect_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_disconnect_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_disconnect_cnf_t."]
pub type sl_wfx_disconnect_cnf_body_t = sl_wfx_disconnect_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_disconnect_req_t.\n @ingroup WFM_GROUP_MODE_STA"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_disconnect_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_disconnect_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_disconnect_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_disconnect_req_t.\n @ingroup WFM_GROUP_MODE_STA"]
pub type sl_wfx_disconnect_cnf_t = sl_wfx_disconnect_cnf_s;
#[doc = " @brief Indication message body for sl_wfx_disconnect_ind_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_ind_body_s {
    #[doc = " @brief MAC address of the access point."]
    pub mac: [u8; 6usize],
    #[doc = " @brief Reason for disconnection.\n @details <B>WFM_DISCONNECTED_REASON_UNSPECIFIED</B>: The device disconnected because of an internal error.\n          <BR><B>WFM_DISCONNECTED_REASON_AP_LOST</B>: The device lost the AP beacons for too long.\n          <BR><B>WFM_DISCONNECTED_REASON_REJECTED</B>: The device was disconnected by the AP.\n          <BR><B>WFM_DISCONNECTED_REASON_LEAVING_BSS</B>: Disconnection was requested through the device API.\n          <BR><B>WFM_DISCONNECTED_REASON_WPA_COUNTERMEASURES</B>: WPA countermeasures triggered a disconnection\n          <BR>See sl_wfx_disconnected_reason_t for enumeration values."]
    pub reason: u16,
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_ind_body_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_disconnect_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_disconnect_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ind_body_s),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ind_body_s),
            "::",
            stringify!(reason)
        )
    );
}
#[doc = " @brief Indication message body for sl_wfx_disconnect_ind_t."]
pub type sl_wfx_disconnect_ind_body_t = sl_wfx_disconnect_ind_body_s;
#[doc = " @brief Indication message used to signal the completion of a disconnection operation.\n @details The device will send this indication to signal the disconnection request initiated\n          with sl_wfx_disconnect_req_t has been completed. The indication is also sent when\n          the device has lost the connection to an access point and has been unable to regain it.\n @ingroup WFM_GROUP_MODE_STA"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_ind_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Indication message body."]
    pub body: sl_wfx_disconnect_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_ind_s>(),
        12usize,
        concat!("Size of: ", stringify!(sl_wfx_disconnect_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_disconnect_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ind_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Indication message used to signal the completion of a disconnection operation.\n @details The device will send this indication to signal the disconnection request initiated\n          with sl_wfx_disconnect_req_t has been completed. The indication is also sent when\n          the device has lost the connection to an access point and has been unable to regain it.\n @ingroup WFM_GROUP_MODE_STA"]
pub type sl_wfx_disconnect_ind_t = sl_wfx_disconnect_ind_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_get_signal_strength_req_t = sl_wfx_header_t;
#[doc = " @brief Confirmation message body for sl_wfx_get_signal_strength_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_get_signal_strength_cnf_body_s {
    #[doc = " @brief Status of the get request.\n @details <B>WFM_STATUS_SUCCESS</B>: the get request was completed.\n          <BR><B>any other value</B>: the get request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
    #[doc = " @brief Received Channel Power Indicator (RCPI) of the connection.\n @details See @ref WFM_CONCEPT_RCPI for further details."]
    pub rcpi: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_get_signal_strength_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_get_signal_strength_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_get_signal_strength_cnf_body_s>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_get_signal_strength_cnf_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_get_signal_strength_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_get_signal_strength_cnf_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_get_signal_strength_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rcpi) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_get_signal_strength_cnf_body_s),
            "::",
            stringify!(rcpi)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_get_signal_strength_cnf_t."]
pub type sl_wfx_get_signal_strength_cnf_body_t = sl_wfx_get_signal_strength_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_get_signal_strength_req_t.\n @ingroup WFM_GROUP_MODE_STA"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_get_signal_strength_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_get_signal_strength_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_get_signal_strength_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_get_signal_strength_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_get_signal_strength_cnf_s>(),
        12usize,
        concat!("Size of: ", stringify!(sl_wfx_get_signal_strength_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_get_signal_strength_cnf_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_get_signal_strength_cnf_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_get_signal_strength_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_get_signal_strength_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_get_signal_strength_req_t.\n @ingroup WFM_GROUP_MODE_STA"]
pub type sl_wfx_get_signal_strength_cnf_t = sl_wfx_get_signal_strength_cnf_s;
#[doc = " @brief Request message body for sl_wfx_set_pm_mode_req_t.\n @details\n          | Field          | Default value      | Reset to default value |\n          |:---------------|:-------------------|:-----------------------|\n          | power_mode      | WFM_PM_MODE_ACTIVE | when interface stopped |\n          | listen_interval | 0                  | when interface stopped |\n          <BR>"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_pm_mode_req_body_s {
    #[doc = " @brief Power management mode.\n @details <B>WFM_PM_MODE_ACTIVE</B>: the device will not use Wi-Fi power management mechanisms.\n          <BR><B>WFM_PM_MODE_BEACON</B>: the device will wake-up on beacons.\n          <BR><B>WFM_PM_MODE_DTIM</B>: the device will wake-up on DTIMs.\n          <BR>See wfm_pm_mode for enumeration values."]
    pub power_mode: u8,
    #[doc = " @brief Power save polling strategy.\n @details <B>WFM_PM_POLL_UAPSD</B>: the device will use U-APSD (default).\n          <BR><B>WFM_PM_POLL_FAST_PS</B>: the device will use Fast Power Save.\n          <BR>See WFM_PM_POLL for enumeration values."]
    pub polling_strategy: u8,
    #[doc = " @brief Number of beacons/DTIMs to skip while sleeping.\n @details <B>0</B>: wake-up on every beacon/DTIM.\n          <BR><B>1 - 600</B>: the number of beacon/DTIMs to skip.\n          <BR>See @ref WFM_CONCEPT_PM for further details."]
    pub listen_interval: u16,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_pm_mode_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_pm_mode_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_pm_mode_req_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_set_pm_mode_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_pm_mode_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_pm_mode_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).power_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_req_body_s),
            "::",
            stringify!(power_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).polling_strategy) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_req_body_s),
            "::",
            stringify!(polling_strategy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).listen_interval) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_req_body_s),
            "::",
            stringify!(listen_interval)
        )
    );
}
#[doc = " @brief Request message body for sl_wfx_set_pm_mode_req_t.\n @details\n          | Field          | Default value      | Reset to default value |\n          |:---------------|:-------------------|:-----------------------|\n          | power_mode      | WFM_PM_MODE_ACTIVE | when interface stopped |\n          | listen_interval | 0                  | when interface stopped |\n          <BR>"]
pub type sl_wfx_set_pm_mode_req_body_t = sl_wfx_set_pm_mode_req_body_s;
#[doc = " @brief Request message for setting the power management mode of the device.\n @details The host can use this request to enable or disable Wi-Fi power management mechanisms.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | No              |\n          | station        | Yes             |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_STA"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_pm_mode_req_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Request message body."]
    pub body: sl_wfx_set_pm_mode_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_pm_mode_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_pm_mode_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_pm_mode_req_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_pm_mode_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_pm_mode_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_pm_mode_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_req_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Request message for setting the power management mode of the device.\n @details The host can use this request to enable or disable Wi-Fi power management mechanisms.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | No              |\n          | station        | Yes             |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_STA"]
pub type sl_wfx_set_pm_mode_req_t = sl_wfx_set_pm_mode_req_s;
#[doc = " @brief Confirmation message body for sl_wfx_set_pm_mode_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_pm_mode_cnf_body_s {
    #[doc = " @brief Status of the power management request.\n @details <B>WFM_STATUS_SUCCESS</B>: the power management request was completed.\n          <BR><B>any other value</B>: the power management request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_pm_mode_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_pm_mode_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_pm_mode_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_set_pm_mode_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_pm_mode_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_pm_mode_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_set_pm_mode_cnf_t."]
pub type sl_wfx_set_pm_mode_cnf_body_t = sl_wfx_set_pm_mode_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_set_pm_mode_req_t.\n @ingroup WFM_GROUP_MODE_STA"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_set_pm_mode_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_set_pm_mode_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_set_pm_mode_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_set_pm_mode_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_set_pm_mode_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_set_pm_mode_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_set_pm_mode_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_set_pm_mode_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_set_pm_mode_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_set_pm_mode_req_t.\n @ingroup WFM_GROUP_MODE_STA"]
pub type sl_wfx_set_pm_mode_cnf_t = sl_wfx_set_pm_mode_cnf_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_ps_mode_error_ind_t = sl_wfx_header_t;
#[doc = " @brief Request message body for sl_wfx_start_ap_req_t."]
#[repr(C, packed)]
pub struct sl_wfx_start_ap_req_body_s {
    #[doc = " @brief Service Set Identifier (SSID) of the network."]
    pub ssid_def: sl_wfx_ssid_def_t,
    #[doc = " @brief Boolean option to hide the network.\n @details <B>0</B>: The device will advertise the SSID of the network to any near-by stations.\n          <BR><B>1</B>: The device will hide the SSID of the network and will only respond\n                        to stations that specify the SSID.\n          <BR>See @ref WFM_CONCEPT_HIDDEN for further details."]
    pub hidden_ssid: u8,
    #[doc = " @brief Boolean option to isolate connected clients from each other.\n @details <B>0</B>: The device will allow connected clients to communicate with each other.\n          <BR><B>1</B>: The device will prevent multiple connected clients from communicating.\n          <BR>Regardless of the value, the connected stations will always be able to communicate with the device.\n          <BR>See @ref WFM_CONCEPT_ISOLATION for further details."]
    pub client_isolation: u8,
    #[doc = " @brief Security mode of the Access Point.\n @details <B>WFM_SECURITY_MODE_OPEN</B>: The device will only allow unsecured connections.\n          <BR><B>WFM_SECURITY_MODE_WEP</B>: The device will only allow WEP connections.\n          <BR><B>WFM_SECURITY_MODE_WPA2_WPA1_PSK</B>: The device will only allow WPA-Personal and WPA2-Personal connections.\n          <BR><B>WFM_SECURITY_MODE_WPA2_PSK</B>: The device will only allow WPA2-Personal connections.\n          <BR><B>WFM_SECURITY_MODE_WPA3_SAE</B>: Unsupported in AP mode\n          <BR>See wfm_security_mode for enumeration values."]
    pub security_mode: u8,
    #[doc = " @brief Protected Management Frames (PMF) mode.\n @details <B>WFM_MGMT_FRAME_PROTECTION_DISABLED</B>: The device will not use PMF even if supported by the connecting station.\n          <BR><B>WFM_MGMT_FRAME_PROTECTION_OPTIONAL</B>: The device will use PMF if supported by the connecting station.\n          <BR><B>WFM_MGMT_FRAME_PROTECTION_MANDATORY</B>: The device will only allow connecting stations that support PMF.\n          <BR>See wfm_mgmt_frame_protection for enumeration values."]
    pub mgmt_frame_protection: u8,
    #[doc = " @brief Channel of the Access Point.\n @details <B>1 - 13</B>: The device will create the access point on the given channel."]
    pub channel: u16,
    #[doc = " @brief Length of the network password.\n @details <B>0 - 64</B>: The amount of bytes."]
    pub password_length: u16,
    #[doc = " @brief Password of the network.\n @details <B>64-bit WEP key</B>: 5 bytes in ASCII format or 10 bytes in HEX format.\n          <BR><B>128-bit WEP key</B>: 13 bytes in ASCII format or 26 bytes in HEX format.\n          <BR><B>WPA pass phrase</B>: 8 - 63 bytes in ASCII format.\n          <BR><B>WPA PMK</B>: 64 bytes in HEX format.\n          <BR>See @ref WFM_CONCEPT_PASSWORD for further details."]
    pub password: [u8; 64usize],
    #[doc = " @brief Length of vendor-specific Information Element (IE) data in 802.11 Beacon frames.\n @details <B>0 - 255</B>: The amount of bytes."]
    pub beacon_ie_data_length: u16,
    #[doc = " @brief Length of vendor-specific Information Element (IE) data in 802.11 Probe Response frames.\n @details <B>0 - 255</B>: The amount of bytes."]
    pub probe_resp_ie_data_length: u16,
    #[doc = " @brief Vendor-specific IE data added to the 802.11 Beacon frames and Probe Response frames.\n @details The IE data must be in 802.11 Vendor-Specific Element format. It may contain\n          multiple concatenated IEs, up to the maximum length. First part of the IE data,\n          up to the amount of bytes specified in BeaconIeDataLength, is added to the Beacon\n          frames. The remaining part whose length is defined in ProbeRespIeDataLength is added\n          to the Probe Response frames.\n          <BR>See @ref WFM_CONCEPT_VENDOR_IE for further details."]
    pub ie_data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_start_ap_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_start_ap_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_start_ap_req_body_s>(),
        112usize,
        concat!("Size of: ", stringify!(sl_wfx_start_ap_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_start_ap_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_start_ap_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ssid_def) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(ssid_def)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hidden_ssid) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(hidden_ssid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).client_isolation) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(client_isolation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security_mode) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(security_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mgmt_frame_protection) as usize - ptr as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(mgmt_frame_protection)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).password_length) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(password_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).password) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).beacon_ie_data_length) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(beacon_ie_data_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).probe_resp_ie_data_length) as usize - ptr as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(probe_resp_ie_data_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_data) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_body_s),
            "::",
            stringify!(ie_data)
        )
    );
}
#[doc = " @brief Request message body for sl_wfx_start_ap_req_t."]
pub type sl_wfx_start_ap_req_body_t = sl_wfx_start_ap_req_body_s;
#[doc = " @brief Request message for starting a Wi-Fi network.\n @details The host can use this request to initiate a Wi-Fi network.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | Yes             |\n          | station        | No              |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
pub struct sl_wfx_start_ap_req_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Request message body."]
    pub body: sl_wfx_start_ap_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_start_ap_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_start_ap_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_start_ap_req_s>(),
        116usize,
        concat!("Size of: ", stringify!(sl_wfx_start_ap_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_start_ap_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_start_ap_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_req_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Request message for starting a Wi-Fi network.\n @details The host can use this request to initiate a Wi-Fi network.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | Yes             |\n          | station        | No              |\n          | AP             | No              |\n          <BR>\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_start_ap_req_t = sl_wfx_start_ap_req_s;
#[doc = " @brief Confirmation message body for sl_wfx_start_ap_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_start_ap_cnf_body_s {
    #[doc = " @brief Status of the start request.\n @details <B>WFM_STATUS_SUCCESS</B>: the start request was accepted. It will be completed by sl_wfx_start_ap_ind_t.\n          <BR><B>any other value</B>: the start request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_start_ap_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_start_ap_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_start_ap_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_start_ap_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_start_ap_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_start_ap_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_start_ap_cnf_t."]
pub type sl_wfx_start_ap_cnf_body_t = sl_wfx_start_ap_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_start_ap_req_t.\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_start_ap_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_start_ap_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_start_ap_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_start_ap_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_start_ap_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_start_ap_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_start_ap_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_start_ap_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_start_ap_req_t.\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_start_ap_cnf_t = sl_wfx_start_ap_cnf_s;
#[doc = " @brief Indication message body for sl_wfx_start_ap_ind_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_start_ap_ind_body_s {
    #[doc = " @brief Status of the start request.\n @details <B>WFM_STATUS_SUCCESS</B>: the start request was completed successfully.\n          <BR><B>any other value</B>: the start request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_start_ap_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_start_ap_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_start_ap_ind_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_start_ap_ind_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_start_ap_ind_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_start_ap_ind_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_ind_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Indication message body for sl_wfx_start_ap_ind_t."]
pub type sl_wfx_start_ap_ind_body_t = sl_wfx_start_ap_ind_body_s;
#[doc = " @brief Indication message used to signal the completion of a start request.\n @details The device will send this indication to signal the start request initiated\n          with sl_wfx_start_ap_req_t has been completed.\n @ingroup WFM_GROUP_MODE_IDLE"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_start_ap_ind_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Indication message body."]
    pub body: sl_wfx_start_ap_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_start_ap_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_start_ap_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_start_ap_ind_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_start_ap_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_start_ap_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_start_ap_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_start_ap_ind_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Indication message used to signal the completion of a start request.\n @details The device will send this indication to signal the start request initiated\n          with sl_wfx_start_ap_req_t has been completed.\n @ingroup WFM_GROUP_MODE_IDLE"]
pub type sl_wfx_start_ap_ind_t = sl_wfx_start_ap_ind_s;
#[doc = " @brief Request message body for sl_wfx_update_ap_req_t."]
#[repr(C, packed)]
pub struct sl_wfx_update_ap_req_body_s {
    #[doc = " @brief Length of vendor-specific Information Element (IE) data in 802.11 Beacon frames.\n @details <B>0 - 255</B>: The amount of bytes."]
    pub beacon_ie_data_length: u16,
    #[doc = " @brief Length of vendor-specific Information Element (IE) data in 802.11 Probe Response frames.\n @details <B>0 - 255</B>: The amount of bytes."]
    pub probe_resp_ie_data_length: u16,
    #[doc = " @brief Vendor-specific IE data added to the 802.11 Beacon frames and Probe Response frames.\n @details The IE data must be in 802.11 Vendor-Specific Element format. It may contain\n          multiple concatenated IEs, up to the maximum length. First part of the IE data,\n          up to the amount of bytes specified in BeaconIeDataLength, is added to the Beacon\n          frames. The remaining part whose length is defined in ProbeRespIeDataLength is added\n          to the Probe Response frames.\n          <BR>See @ref WFM_CONCEPT_VENDOR_IE for further details."]
    pub ie_data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_sl_wfx_update_ap_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_update_ap_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_update_ap_req_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_update_ap_req_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_update_ap_req_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_update_ap_req_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).beacon_ie_data_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_req_body_s),
            "::",
            stringify!(beacon_ie_data_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).probe_resp_ie_data_length) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_req_body_s),
            "::",
            stringify!(probe_resp_ie_data_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_req_body_s),
            "::",
            stringify!(ie_data)
        )
    );
}
#[doc = " @brief Request message body for sl_wfx_update_ap_req_t."]
pub type sl_wfx_update_ap_req_body_t = sl_wfx_update_ap_req_body_s;
#[doc = " @brief Request message for updating parameters of the started Wi-Fi network.\n @details The host can use this request to update parameters of the started Wi-Fi network.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | No              |\n          | station        | No              |\n          | AP             | Yes             |\n          <BR>\n @ingroup WFM_GROUP_MODE_AP"]
#[repr(C, packed)]
pub struct sl_wfx_update_ap_req_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Request message body."]
    pub body: sl_wfx_update_ap_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_update_ap_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_update_ap_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_update_ap_req_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_update_ap_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_update_ap_req_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_update_ap_req_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_req_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Request message for updating parameters of the started Wi-Fi network.\n @details The host can use this request to update parameters of the started Wi-Fi network.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | No              |\n          | station        | No              |\n          | AP             | Yes             |\n          <BR>\n @ingroup WFM_GROUP_MODE_AP"]
pub type sl_wfx_update_ap_req_t = sl_wfx_update_ap_req_s;
#[doc = " @brief Confirmation message body for sl_wfx_update_ap_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_update_ap_cnf_body_s {
    #[doc = " @brief Status of the update request.\n @details <B>WFM_STATUS_SUCCESS</B>: the update request was completed.\n          <BR><B>any other value</B>: the update request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_update_ap_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_update_ap_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_update_ap_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_update_ap_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_update_ap_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_update_ap_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_update_ap_cnf_t."]
pub type sl_wfx_update_ap_cnf_body_t = sl_wfx_update_ap_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_update_ap_req_t.\n @ingroup WFM_GROUP_MODE_AP"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_update_ap_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_update_ap_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_update_ap_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_update_ap_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_update_ap_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_update_ap_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_update_ap_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_update_ap_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_update_ap_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_update_ap_req_t.\n @ingroup WFM_GROUP_MODE_AP"]
pub type sl_wfx_update_ap_cnf_t = sl_wfx_update_ap_cnf_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_stop_ap_req_t = sl_wfx_header_t;
#[doc = " @brief Confirmation message body for sl_wfx_stop_ap_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_stop_ap_cnf_body_s {
    #[doc = " @brief Status of the stop request.\n @details <B>WFM_STATUS_SUCCESS</B>: the stop request was accepted. It will be completed by sl_wfx_stop_ap_ind_t.\n          <BR><B>any other value</B>: the stop request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_stop_ap_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_stop_ap_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_stop_ap_cnf_body_s>(),
        4usize,
        concat!("Size of: ", stringify!(sl_wfx_stop_ap_cnf_body_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_stop_ap_cnf_body_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_stop_ap_cnf_body_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_stop_ap_cnf_body_s),
            "::",
            stringify!(status)
        )
    );
}
#[doc = " @brief Confirmation message body for sl_wfx_stop_ap_cnf_t."]
pub type sl_wfx_stop_ap_cnf_body_t = sl_wfx_stop_ap_cnf_body_s;
#[doc = " @brief Confirmation message for sl_wfx_stop_ap_req_t.\n @ingroup WFM_GROUP_MODE_AP"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_stop_ap_cnf_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Confirmation message body."]
    pub body: sl_wfx_stop_ap_cnf_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_stop_ap_cnf_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_stop_ap_cnf_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_stop_ap_cnf_s>(),
        8usize,
        concat!("Size of: ", stringify!(sl_wfx_stop_ap_cnf_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_stop_ap_cnf_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_stop_ap_cnf_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_stop_ap_cnf_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_stop_ap_cnf_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Confirmation message for sl_wfx_stop_ap_req_t.\n @ingroup WFM_GROUP_MODE_AP"]
pub type sl_wfx_stop_ap_cnf_t = sl_wfx_stop_ap_cnf_s;
#[doc = " @brief General Message header structure\n"]
pub type sl_wfx_stop_ap_ind_t = sl_wfx_header_t;
#[doc = " @brief Indication message body for sl_wfx_ap_client_connected_ind_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_ap_client_connected_ind_body_s {
    #[doc = " @brief MAC address of the station."]
    pub mac: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_ap_client_connected_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_ap_client_connected_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_ap_client_connected_ind_body_s>(),
        6usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_ap_client_connected_ind_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_ap_client_connected_ind_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_ap_client_connected_ind_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_connected_ind_body_s),
            "::",
            stringify!(mac)
        )
    );
}
#[doc = " @brief Indication message body for sl_wfx_ap_client_connected_ind_t."]
pub type sl_wfx_ap_client_connected_ind_body_t = sl_wfx_ap_client_connected_ind_body_s;
#[doc = " @brief Indication message used to signal a connected station.\n @details The device will send this indication to signal a station has connected\n          to the started network.\n @ingroup WFM_GROUP_MODE_AP"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_ap_client_connected_ind_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Indication message body."]
    pub body: sl_wfx_ap_client_connected_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_ap_client_connected_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_ap_client_connected_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_ap_client_connected_ind_s>(),
        10usize,
        concat!("Size of: ", stringify!(sl_wfx_ap_client_connected_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_ap_client_connected_ind_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_ap_client_connected_ind_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_connected_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_connected_ind_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Indication message used to signal a connected station.\n @details The device will send this indication to signal a station has connected\n          to the started network.\n @ingroup WFM_GROUP_MODE_AP"]
pub type sl_wfx_ap_client_connected_ind_t = sl_wfx_ap_client_connected_ind_s;
#[doc = " @brief Indication message body for sl_wfx_ap_client_rejected_ind_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_ap_client_rejected_ind_body_s {
    #[doc = " @brief MAC address of the station."]
    pub mac: [u8; 6usize],
    #[doc = " @brief Reason for rejection.\n @details <B>WFM_REASON_TIMEOUT</B>: A timeout occurred during a station connection attempt.\n          <BR><B>WFM_REASON_LEAVING_BSS</B>: The device sent a deauth before completing the connection.\n          <BR><B>WFM_REASON_UNKNOWN_STA</B>: The device received data from a non-connected station.\n          <BR><B>WFM_REASON_AP_FULL</B>: The device was not able to accommodate any more stations.\n          <BR><B>WFM_REASON_AUTHENTICATION_FAILURE</B>: The device did not complete the WPA authentication successfully.\n          <BR>See wfm_reason for enumeration values."]
    pub reason: u16,
}
#[test]
fn bindgen_test_layout_sl_wfx_ap_client_rejected_ind_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_ap_client_rejected_ind_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_ap_client_rejected_ind_body_s>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_ap_client_rejected_ind_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_ap_client_rejected_ind_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_ap_client_rejected_ind_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_rejected_ind_body_s),
            "::",
            stringify!(mac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_rejected_ind_body_s),
            "::",
            stringify!(reason)
        )
    );
}
#[doc = " @brief Indication message body for sl_wfx_ap_client_rejected_ind_t."]
pub type sl_wfx_ap_client_rejected_ind_body_t = sl_wfx_ap_client_rejected_ind_body_s;
#[doc = " @brief Indication message used to signal a rejected connection attempt from a station.\n @details The device will send this indication to signal a station has attempted\n          connection to the started network and was rejected by the device.\n @ingroup WFM_GROUP_MODE_AP"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_ap_client_rejected_ind_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Indication message body."]
    pub body: sl_wfx_ap_client_rejected_ind_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_ap_client_rejected_ind_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_ap_client_rejected_ind_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_ap_client_rejected_ind_s>(),
        12usize,
        concat!("Size of: ", stringify!(sl_wfx_ap_client_rejected_ind_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_ap_client_rejected_ind_s>(),
        1usize,
        concat!("Alignment of ", stringify!(sl_wfx_ap_client_rejected_ind_s))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_rejected_ind_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_ap_client_rejected_ind_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Indication message used to signal a rejected connection attempt from a station.\n @details The device will send this indication to signal a station has attempted\n          connection to the started network and was rejected by the device.\n @ingroup WFM_GROUP_MODE_AP"]
pub type sl_wfx_ap_client_rejected_ind_t = sl_wfx_ap_client_rejected_ind_s;
#[doc = " @brief Request message body for sl_wfx_disconnect_ap_client_req_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_ap_client_req_body_s {
    #[doc = " @brief MAC address of the station."]
    pub mac: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_ap_client_req_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_ap_client_req_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_ap_client_req_body_s>(),
        6usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_disconnect_ap_client_req_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_ap_client_req_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_disconnect_ap_client_req_body_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ap_client_req_body_s),
            "::",
            stringify!(mac)
        )
    );
}
#[doc = " @brief Request message body for sl_wfx_disconnect_ap_client_req_t."]
pub type sl_wfx_disconnect_ap_client_req_body_t = sl_wfx_disconnect_ap_client_req_body_s;
#[doc = " @brief Request message for disconnecting a client from the started Wi-Fi network.\n @details The host can use this request to disconnect a client from the started Wi-Fi network.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | No              |\n          | station        | No              |\n          | AP             | Yes             |\n          <BR>\n @ingroup WFM_GROUP_MODE_AP"]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_ap_client_req_s {
    #[doc = " Common message header."]
    pub header: sl_wfx_header_t,
    #[doc = " Request message body."]
    pub body: sl_wfx_disconnect_ap_client_req_body_t,
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_ap_client_req_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_ap_client_req_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_ap_client_req_s>(),
        10usize,
        concat!("Size of: ", stringify!(sl_wfx_disconnect_ap_client_req_s))
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_ap_client_req_s>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(sl_wfx_disconnect_ap_client_req_s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ap_client_req_s),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).body) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sl_wfx_disconnect_ap_client_req_s),
            "::",
            stringify!(body)
        )
    );
}
#[doc = " @brief Request message for disconnecting a client from the started Wi-Fi network.\n @details The host can use this request to disconnect a client from the started Wi-Fi network.\n          | Interface mode | Request allowed |\n          |:---------------|:----------------|\n          | idle           | No              |\n          | station        | No              |\n          | AP             | Yes             |\n          <BR>\n @ingroup WFM_GROUP_MODE_AP"]
pub type sl_wfx_disconnect_ap_client_req_t = sl_wfx_disconnect_ap_client_req_s;
#[doc = " @brief Confirmation message body for sl_wfx_disconnect_ap_client_cnf_t."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct sl_wfx_disconnect_ap_client_cnf_body_s {
    #[doc = " @brief Status of the disconnect request.\n @details <B>WFM_STATUS_SUCCESS</B>: the disconnect request was completed.\n          <BR><B>any other value</B>: the disconnect request failed.\n          <BR>See sl_wfx_fmac_status_t for enumeration values."]
    pub status: u32,
}
#[test]
fn bindgen_test_layout_sl_wfx_disconnect_ap_client_cnf_body_s() {
    const UNINIT: ::core::mem::MaybeUninit<sl_wfx_disconnect_ap_client_cnf_body_s> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sl_wfx_disconnect_ap_client_cnf_body_s>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(sl_wfx_disconnect_ap_client_cnf_body_s)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sl_wfx_disconnect_ap_client_cnf_body_s>(),
        1usize,
        concat!(
            "Alignment of ",
